gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/*
--------------------------------------------------------------------------
SLEEP - Sleep Controller
--------------------------------------------------------------------------
*/

/* Sleep Controller */
typedef struct SLEEP_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t reserved_1[1];
} SLEEP_t;

/* Sleep Mode */
typedef enum SLEEP_SMODE_enum
{
    SLEEP_SMODE_IDLE_gc = (0x00<<1),  /* Idle mode */
    SLEEP_SMODE_PSAVE_gc = (0x01<<1),  /* Power-save Mode */
} SLEEP_SMODE_t;

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_PWR_SAVE (0x01<<1)
/*
--------------------------------------------------------------------------
TIM8_16 - Timer 8/16 bit
--------------------------------------------------------------------------
*/

/* Timer 8/16 bit */
typedef struct TIM8_16_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t INTMSK;  /* Interrupt Mask Register */
    register8_t STATUS;  /* Status Register */
    register8_t TEMP;  /* Temporary Register */
    register8_t reserved_1[3];
    register8_t COUNTL;  /* Count Register Low Byte */
    register8_t COUNTH;  /* Count Register High Byte */
    register8_t OCRA;  /* Output Compare Register A */
    register8_t OCRB;  /* Output Compare Register B */
    register8_t reserved_2[4];
} TIM8_16_t;

/* Clock Select */
typedef enum TIM8_16_CS_enum
{
    TIM8_16_CS_STOPPED_gc = (0x00<<0),  /* No clock selected */
    TIM8_16_CS_CLKIO_gc = (0x01<<0),  /* clkIO - No prescaling */
    TIM8_16_CS_CLKIO_DIV8_gc = (0x02<<0),  /* clkIO/8 from prescaling */
    TIM8_16_CS_CLKIO_DIV64_gc = (0x03<<0),  /* clkIO/64 from prescaling */
    TIM8_16_CS_CLKIO_DIV256_gc = (0x04<<0),  /* clkIO/256 from prescaling */
    TIM8_16_CS_CLKIO_DIV1024_gc = (0x05<<0),  /* clkIO/1024 from prescaling */
    TIM8_16_CS_8U6_gc = (0x06<<0),  /* 8us clock selected */
    TIM8_16_CS_16U_gc = (0x07<<0),  /* 16us clock selected */
    TIM8_16_CS_64U_gc = (0x08<<0),  /* 64us clock selected */
    TIM8_16_CS_256U_gc = (0x09<<0),  /* 256us clock selected */
    TIM8_16_CS_1M_gc = (0x0A<<0),  /* 1ms clock selected */
    TIM8_16_CS_4M_gc = (0x0B<<0),  /* 4ms clock selected */
    TIM8_16_CS_16M_gc = (0x0C<<0),  /* 16ms clock selected */
    TIM8_16_CS_65M_gc = (0x0D<<0),  /* 65ms clock selected */
    TIM8_16_CS_262M_gc = (0x0E<<0),  /* 262ms clock selected */
    TIM8_16_CS_1S_gc = (0x0F<<0),  /* 1s clock selected */
} TIM8_16_CS_t;

/* Input Capture Select */
typedef enum TIM8_16_ICS_enum
{
    TIM8_16_ICS_PC0_gc = (0x00<<4),  /* Input capture source = PB0 */
    TIM8_16_ICS_PC1_gc = (0x01<<4),  /* Input capture source = PB1 */
    TIM8_16_ICS_PA0_gc = (0x02<<4),  /* Input capture source = PB2 */
} TIM8_16_ICS_t;

/*
--------------------------------------------------------------------------
TIMPRESC - Timer Prescaler
--------------------------------------------------------------------------
*/

/* Timer Prescaler */
typedef struct TIMPRESC_struct
{
    register8_t PRESC;  /* Prescaler Register */
    register8_t reserved_1[1];
} TIMPRESC_t;


/*
--------------------------------------------------------------------------
TWI - Two-Wire Interface
--------------------------------------------------------------------------
*/

/* Two-Wire Master Interface */
typedef struct TWI_MASTER_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t CTRLC;  /* Control Register C */
    register8_t STATUS;  /* Status Register */
    register8_t BAUD;  /* Baud Rate Control Register */
    register8_t ADDR;  /* Address Register */
    register8_t DATA;  /* Data Register */
} TWI_MASTER_t;


/* Two-Wire Slave Interface */
typedef struct TWI_SLAVE_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t CTRLB;  /* Control Register B */
    register8_t STATUS;  /* Status Register */
    register8_t ADDR;  /* Address Register */
    register8_t DATA;  /* Data Register */
    register8_t ADDRMASK;  /* Address Mask Register */
} TWI_SLAVE_t;


/* Two-Wire Interface */
typedef struct TWI_struct
{
    register8_t CTRL;  /* TWI Common Control Register */
    TWI_MASTER_t MASTER;  /* TWI Master */
    TWI_SLAVE_t SLAVE;  /* TWI Slave */
} TWI_t;

/* Master Bus State */
typedef enum TWI_MASTER_BUSSTATE_enum
{
    TWI_MASTER_BUSSTATE_UNKNOWN_gc = (0x00<<0),  /* Unknown Bus State */
    TWI_MASTER_BUSSTATE_IDLE_gc = (0x01<<0),  /* Bus is Idle */
    TWI_MASTER_BUSSTATE_OWNER_gc = (0x02<<0),  /* This Module Controls The Bus */
    TWI_MASTER_BUSSTATE_BUSY_gc = (0x03<<0),  /* The Bus is Busy */
} TWI_MASTER_BUSSTATE_t;

/* Master Command */
typedef enum TWI_MASTER_CMD_enum
{
    TWI_MASTER_CMD_NOACT_gc = (0x00<<0),  /* No Action */
    TWI_MASTER_CMD_REPSTART_gc = (0x01<<0),  /* Issue Repeated Start Condition */
    TWI_MASTER_CMD_RECVTRANS_gc = (0x02<<0),  /* Receive or Transmit Data */
    TWI_MASTER_CMD_STOP_gc = (0x03<<0),  /* Issue Stop Condition */
} TWI_MASTER_CMD_t;

/* Master Interrupt Level */
typedef enum TWI_MASTER_INTLVL_enum
{
    TWI_MASTER_INTLVL_OFF_gc = (0x00<<6),  /* Interrupt Disabled */
    TWI_MASTER_INTLVL_LO_gc = (0x01<<6),  /* Low Level */
    TWI_MASTER_INTLVL_MED_gc = (0x02<<6),  /* Medium Level */
    TWI_MASTER_INTLVL_HI_gc = (0x03<<6),  /* High Level */
} TWI_MASTER_INTLVL_t;

/* Inactive Timeout */
typedef enum TWI_MASTER_TIMEOUT_enum
{
    TWI_MASTER_TIMEOUT_DISABLED_gc = (0x00<<2),  /* Bus Timeout Disabled */
    TWI_MASTER_TIMEOUT_50US_gc = (0x01<<2),  /* 50 Microseconds */
    TWI_MASTER_TIMEOUT_100US_gc = (0x02<<2),  /* 100 Microseconds */
    TWI_MASTER_TIMEOUT_200US_gc = (0x03<<2),  /* 200 Microseconds */
} TWI_MASTER_TIMEOUT_t;

/* Slave Command */
typedef enum TWI_SLAVE_CMD_enum
{
    TWI_SLAVE_CMD_NOACT_gc = (0x00<<0),  /* No Action */
    TWI_SLAVE_CMD_COMPTRANS_gc = (0x02<<0),  /* Used To Complete a Transaction */
    TWI_SLAVE_CMD_RESPONSE_gc = (0x03<<0),  /* Used in Response to Address/Data Interrupt */
} TWI_SLAVE_CMD_t;

/* Slave Interrupt Level */
typedef enum TWI_SLAVE_INTLVL_enum
{
    TWI_SLAVE_INTLVL_OFF_gc = (0x00<<6),  /* Interrupt Disabled */
    TWI_SLAVE_INTLVL_LO_gc = (0x01<<6),  /* Low Level */
    TWI_SLAVE_INTLVL_MED_gc = (0x02<<6),  /* Medium Level */
    TWI_SLAVE_INTLVL_HI_gc = (0x03<<6),  /* High Level */
} TWI_SLAVE_INTLVL_t;

