gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/*
--------------------------------------------------------------------------
VPORT - Virtual Ports
--------------------------------------------------------------------------
*/

/* Virtual Port */
typedef struct VPORT_struct
{
    register8_t DIR;  /* I/O Port Data Direction */
    register8_t OUT;  /* I/O Port Output */
    register8_t IN;  /* I/O Port Input */
    register8_t INTFLAGS;  /* Interrupt Flag Register */
    register8_t reserved_1[12];
} VPORT_t;


/*
--------------------------------------------------------------------------
WDT - Watch-Dog Timer
--------------------------------------------------------------------------
*/

/* Watch-Dog Timer */
typedef struct WDT_struct
{
    register8_t CTRL;  /* Control */
    register8_t WINCTRL;  /* Windowed Mode Control */
    register8_t STATUS;  /* Status */
    register8_t reserved_1[13];
} WDT_t;

/* Period setting */
typedef enum WDT_PER_enum
{
    WDT_PER_8CLK_gc = (0x00<<2),  /* 8 cycles (8ms) */
    WDT_PER_16CLK_gc = (0x01<<2),  /* 16 cycles (16ms) */
    WDT_PER_32CLK_gc = (0x02<<2),  /* 32 cycles (32ms) */
    WDT_PER_64CLK_gc = (0x03<<2),  /* 64 cycles (64ms) */
    WDT_PER_128CLK_gc = (0x04<<2),  /* 128 cycles (0.128s) */
    WDT_PER_256CLK_gc = (0x05<<2),  /* 256 cycles (0.26s) */
    WDT_PER_512CLK_gc = (0x06<<2),  /* 512 cycles (0.5s) */
    WDT_PER_1KCLK_gc = (0x07<<2),  /* 1K cycles (1s) */
    WDT_PER_2KCLK_gc = (0x08<<2),  /* 2K cycles (2s) */
    WDT_PER_4KCLK_gc = (0x09<<2),  /* 4K cycles (4s) */
    WDT_PER_8KCLK_gc = (0x0A<<2),  /* 8K cycles (8s) */
} WDT_PER_t;

/* Closed window period */
typedef enum WDT_WPER_enum
{
    WDT_WPER_8CLK_gc = (0x00<<2),  /* 8 cycles (8ms ) */
    WDT_WPER_16CLK_gc = (0x01<<2),  /* 16 cycles (16ms ) */
    WDT_WPER_32CLK_gc = (0x02<<2),  /* 32 cycles (32ms ) */
    WDT_WPER_64CLK_gc = (0x03<<2),  /* 64 cycles (64ms ) */
    WDT_WPER_128CLK_gc = (0x04<<2),  /* 128 cycles (0.128s) */
    WDT_WPER_256CLK_gc = (0x05<<2),  /* 256 cycles (0.26s) */
    WDT_WPER_512CLK_gc = (0x06<<2),  /* 512 cycles (0.5s) */
    WDT_WPER_1KCLK_gc = (0x07<<2),  /* 1K cycles (1s ) */
    WDT_WPER_2KCLK_gc = (0x08<<2),  /* 2K cycles (2s ) */
    WDT_WPER_4KCLK_gc = (0x09<<2),  /* 4K cycles (4s ) */
    WDT_WPER_8KCLK_gc = (0x0A<<2),  /* 8K cycles (8s ) */
} WDT_WPER_t;

/*
--------------------------------------------------------------------------
WUT - Wake-up Timer
--------------------------------------------------------------------------
*/

/* Wake-up Timer */
typedef struct WUT_struct
{
    register8_t CTRL;  /* Control Register */
    register8_t INTCTRL;  /* Interrupt Control Register */
    register8_t STATUS;  /* Status Register */
    register8_t reserved_1[1];
} WUT_t;

/* Wake-up Timer Mode */
typedef enum WUT_MODE_enum
{
    WUT_MODE_DISABLE_gc = (0x00<<3),  /* Disabled */
    WUT_MODE_DIRECT_gc = (0x01<<3),  /* Direct on Timekeeper event  */
    WUT_MODE_EVERY_8TH_gc = (0x02<<3),  /* Every 8th Timekeeper event */
} WUT_MODE_t;

/* Wake-up Timer Prescaling */
typedef enum WUT_PRESC_enum
{
    WUT_PRESC_PRESC_8_gc = (0x00<<0),  /* 64us with 125kHz Timerkeeper clock (actual clock is chip dependent) */
    WUT_PRESC_RPESC_16_gc = (0x01<<0),  /* 128us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_32_gc = (0x02<<0),  /* 256us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_64_gc = (0x03<<0),  /* 512us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_128_gc = (0x04<<0),  /* 1024us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_256_gc = (0x05<<0),  /* 2048us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_512_gc = (0x06<<0),  /* 4096us with 125kHz Timekeeper clock (actual clock is chip dependent) */
    WUT_PRESC_PRESC_1024_gc = (0x07<<0),  /* 8192us with 125kHz Timekeeper clock (actual clock is chip dependent) */
} WUT_PRESC_t;

/*
--------------------------------------------------------------------------
XOCD - On-Chip Debug System
--------------------------------------------------------------------------
*/

/* On-Chip Debug System */
typedef struct OCD_struct
{
    register8_t OCDR0;  /* OCD Register 0 */
    register8_t OCDR1;  /* OCD Register 1 */
} OCD_t;

/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORT0              (*(VPORT_t *) 0x0010) /* Virtual Port */
#define VPORT1              (*(VPORT_t *) 0x0014) /* Virtual Port */
#define VPORT2              (*(VPORT_t *) 0x0018) /* Virtual Port */
#define VPORT3              (*(VPORT_t *) 0x001C) /* Virtual Port */
#define OCD                   (*(OCD_t *) 0x002E) /* On-Chip Debug System */
#define SLEEP               (*(SLEEP_t *) 0x0040) /* Sleep Controller */
#define RST                   (*(RST_t *) 0x0044) /* Reset */
#define BANDGAP           (*(BANDGAP_t *) 0x0048) /* Bandgap */
#define BIASCTRL         (*(BIASCTRL_t *) 0x004A) /* BIASCTRL */
#define LDO                   (*(LDO_t *) 0x004C) /* LDO */
#define CLK                   (*(CLK_t *) 0x0050) /* Clock System */
#define WDT                   (*(WDT_t *) 0x0080) /* Watch-Dog Timer */
#define MCU                   (*(MCU_t *) 0x0090) /* MCU Control */
#define PMIC                 (*(PMIC_t *) 0x00A0) /* Programmable Multi-level Interrupt Controller */
#define WUT                   (*(WUT_t *) 0x00C0) /* Wake-up Timer */
#define CRC4                 (*(CRC4_t *) 0x00C4) /* Cyclic Redundancy Checker */
#define NVM                   (*(NVM_t *) 0x01C0) /* Non-volatile Memory Controller */
#define BOOSTIF           (*(BOOSTIF_t *) 0x03D8) /* Boost Converter Interface */
#define PWRCTRL           (*(PWRCTRL_t *) 0x03E4) /* VS PM Control Interface */
#define TWIC                  (*(TWI_t *) 0x03F0) /* Two-Wire Interface */
#define TIMER0            (*(TIM8_16_t *) 0x0400) /* Timer 8/16 bit */
#define TIMER1            (*(TIM8_16_t *) 0x0410) /* Timer 8/16 bit */
#define TIMPRESC         (*(TIMPRESC_t *) 0x0420) /* Timer Prescaler */
#define PORTA                (*(PORT_t *) 0x0480) /* I/O Ports */
#define PORTB                (*(PORT_t *) 0x04A0) /* I/O Ports */
#define PORTC                (*(PORT_t *) 0x04C0) /* I/O Ports */
#define PULLDOWN         (*(PULLDOWN_t *) 0x0500) /* Pulldown */
#define ADCCMN            (*(ADC_CMN_t *) 0x0800) /* ADC Common Settings */
#define ADCGENCH        (*(ADC_GEN_CH_t *) 0x0810) /* ADC General Channel */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* GPIO - General Purpose IO Registers */
#define GPIO_GPIOR0  _SFR_MEM8(0x0000)
#define GPIO_GPIOR1  _SFR_MEM8(0x0001)
#define GPIO_GPIOR2  _SFR_MEM8(0x0002)
#define GPIO_GPIOR3  _SFR_MEM8(0x0003)


