gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* Deprecated */
#define GPIO_GPIO0  _SFR_MEM8(0x0000)
#define GPIO_GPIO1  _SFR_MEM8(0x0001)
#define GPIO_GPIO2  _SFR_MEM8(0x0002)
#define GPIO_GPIO3  _SFR_MEM8(0x0003)


/* NVM_FUSES (FUSE) - Fuses */
#define FUSE_FUSEBYTE4  _SFR_MEM8(0x0004)
#define FUSE_FUSEBYTE5  _SFR_MEM8(0x0005)
#define FUSE_FUSEBYTE6  _SFR_MEM8(0x0006)


/* NVM_LOCKBITS (LOCKBIT) - Lockbits */
#define LOCKBIT_LOCKBITS  _SFR_MEM8(0x0000)


/* NVM_PROD_SIGNATURES (PROD_SIGNATURES) - Production Signatures */
#define PRODSIGNATURES_LOTNUM0  _SFR_MEM8(0x0008)
#define PRODSIGNATURES_LOTNUM1  _SFR_MEM8(0x0009)
#define PRODSIGNATURES_LOTNUM2  _SFR_MEM8(0x000A)
#define PRODSIGNATURES_LOTNUM3  _SFR_MEM8(0x000B)
#define PRODSIGNATURES_LOTNUM4  _SFR_MEM8(0x000C)
#define PRODSIGNATURES_LOTNUM5  _SFR_MEM8(0x000D)
#define PRODSIGNATURES_WAFNUM  _SFR_MEM8(0x0010)
#define PRODSIGNATURES_COORDX0  _SFR_MEM8(0x0012)
#define PRODSIGNATURES_COORDX1  _SFR_MEM8(0x0013)
#define PRODSIGNATURES_COORDY0  _SFR_MEM8(0x0014)
#define PRODSIGNATURES_COORDY1  _SFR_MEM8(0x0015)
#define PRODSIGNATURES_ADCCAL  _SFR_MEM8(0x0020)
#define PRODSIGNATURES_TEMPSENSE25CL  _SFR_MEM8(0x0021)
#define PRODSIGNATURES_TEMPSENSE25CH  _SFR_MEM8(0x0022)
#define PRODSIGNATURES_TEMPSENSE85CL  _SFR_MEM8(0x0023)
#define PRODSIGNATURES_TEMPSENSE85CH  _SFR_MEM8(0x0024)
#define PRODSIGNATURES_BATTOFFSET  _SFR_MEM8(0x0028)
#define PRODSIGNATURES_BATTGAINL  _SFR_MEM8(0x0029)
#define PRODSIGNATURES_BATTGAINH  _SFR_MEM8(0x002A)
#define PRODSIGNATURES_TESTTEMPROOM  _SFR_MEM8(0x002B)
#define PRODSIGNATURES_TESTTEMPHOTDIFF  _SFR_MEM8(0x002C)
#define PRODSIGNATURES_RCCAL24MHZL  _SFR_MEM8(0x0040)
#define PRODSIGNATURES_RCCAL24MHZH  _SFR_MEM8(0x0041)
#define PRODSIGNATURES_ULPRCCALL  _SFR_MEM8(0x0042)
#define PRODSIGNATURES_ULPRCCALH  _SFR_MEM8(0x0043)
#define PRODSIGNATURES_RC24MHZROOML  _SFR_MEM8(0x0060)
#define PRODSIGNATURES_RC24MHZROOMH  _SFR_MEM8(0x0061)
#define PRODSIGNATURES_RC24MHZHOTL  _SFR_MEM8(0x0062)
#define PRODSIGNATURES_RC24MHZHOTH  _SFR_MEM8(0x0063)
#define PRODSIGNATURES_ULPRCROOML  _SFR_MEM8(0x0064)
#define PRODSIGNATURES_ULPRCROOMH  _SFR_MEM8(0x0065)
#define PRODSIGNATURES_ULPRCHOTL  _SFR_MEM8(0x0066)
#define PRODSIGNATURES_ULPRCHOTH  _SFR_MEM8(0x0067)


/* VPORT (VPORT0) - Virtual Port */
#define VPORT0_DIR  _SFR_MEM8(0x0010)
#define VPORT0_OUT  _SFR_MEM8(0x0011)
#define VPORT0_IN  _SFR_MEM8(0x0012)
#define VPORT0_INTFLAGS  _SFR_MEM8(0x0013)


/* VPORT (VPORT1) - Virtual Port */
#define VPORT1_DIR  _SFR_MEM8(0x0014)
#define VPORT1_OUT  _SFR_MEM8(0x0015)
#define VPORT1_IN  _SFR_MEM8(0x0016)
#define VPORT1_INTFLAGS  _SFR_MEM8(0x0017)


/* VPORT (VPORT2) - Virtual Port */
#define VPORT2_DIR  _SFR_MEM8(0x0018)
#define VPORT2_OUT  _SFR_MEM8(0x0019)
#define VPORT2_IN  _SFR_MEM8(0x001A)
#define VPORT2_INTFLAGS  _SFR_MEM8(0x001B)


/* VPORT (VPORT3) - Virtual Port */
#define VPORT3_DIR  _SFR_MEM8(0x001C)
#define VPORT3_OUT  _SFR_MEM8(0x001D)
#define VPORT3_IN  _SFR_MEM8(0x001E)
#define VPORT3_INTFLAGS  _SFR_MEM8(0x001F)


/* OCD - On-Chip Debug System */
#define OCD_OCDR0  _SFR_MEM8(0x002E)
#define OCD_OCDR1  _SFR_MEM8(0x002F)


/* CPU - CPU registers */
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_RAMPD  _SFR_MEM8(0x0038)
#define CPU_RAMPX  _SFR_MEM8(0x0039)
#define CPU_RAMPY  _SFR_MEM8(0x003A)
#define CPU_RAMPZ  _SFR_MEM8(0x003B)
#define CPU_EIND  _SFR_MEM8(0x003C)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* SLEEP - Sleep Controller */
#define SLEEP_CTRL  _SFR_MEM8(0x0040)


/* RST - Reset */
#define RST_STATUS  _SFR_MEM8(0x0044)
#define RST_CTRL  _SFR_MEM8(0x0045)


/* BANDGAP - Bandgap */
#define BANDGAP_CTRL  _SFR_MEM8(0x0048)


/* BIASCTRL - BIASCTRL */
#define BIASCTRL_CTRL  _SFR_MEM8(0x004A)


/* LDO - LDO */
#define LDO_CTRL  _SFR_MEM8(0x004C)


/* CLK - Clock System */
#define CLK_CLKPSR  _SFR_MEM8(0x0050)
#define CLK_CLKSLR  _SFR_MEM8(0x0051)
#define CLK_FRCCALL  _SFR_MEM8(0x0054)
#define CLK_FRCCALH  _SFR_MEM8(0x0055)
#define CLK_ULPRCCALL  _SFR_MEM8(0x0056)
#define CLK_ULPRCCALH  _SFR_MEM8(0x0057)


/* WDT - Watch-Dog Timer */
#define WDT_CTRL  _SFR_MEM8(0x0080)
#define WDT_WINCTRL  _SFR_MEM8(0x0081)
#define WDT_STATUS  _SFR_MEM8(0x0082)


/* MCU - MCU Control */
#define MCU_DEVID0  _SFR_MEM8(0x0090)
#define MCU_DEVID1  _SFR_MEM8(0x0091)
#define MCU_DEVID2  _SFR_MEM8(0x0092)
#define MCU_REVID  _SFR_MEM8(0x0093)


/* PMIC - Programmable Multi-level Interrupt Controller */
#define PMIC_STATUS  _SFR_MEM8(0x00A0)
#define PMIC_INTPRI  _SFR_MEM8(0x00A1)
#define PMIC_CTRL  _SFR_MEM8(0x00A2)


/* WUT - Wake-up Timer */
#define WUT_CTRL  _SFR_MEM8(0x00C0)
#define WUT_INTCTRL  _SFR_MEM8(0x00C1)
#define WUT_STATUS  _SFR_MEM8(0x00C2)


/* CRC4 - Cyclic Redundancy Checker */
#define CRC4_DATAIN  _SFR_MEM8(0x00C4)
#define CRC4_CHECKSUM  _SFR_MEM8(0x00C5)


/* NVM - Non-volatile Memory Controller */
#define NVM_ADDR0  _SFR_MEM8(0x01C0)
#define NVM_ADDR1  _SFR_MEM8(0x01C1)
#define NVM_ADDR2  _SFR_MEM8(0x01C2)
#define NVM_DATA0  _SFR_MEM8(0x01C4)
#define NVM_DATA1  _SFR_MEM8(0x01C5)
#define NVM_DATA2  _SFR_MEM8(0x01C6)
#define NVM_CMD  _SFR_MEM8(0x01CA)
#define NVM_CTRLA  _SFR_MEM8(0x01CB)
#define NVM_CTRLB  _SFR_MEM8(0x01CC)
#define NVM_INTCTRL  _SFR_MEM8(0x01CD)
#define NVM_STATUS  _SFR_MEM8(0x01CF)
#define NVM_LOCKBITS  _SFR_MEM8(0x01D0)


/* BOOSTIF - Boost Converter Interface */
#define BOOSTIF_CTRLA  _SFR_MEM8(0x03D8)
#define BOOSTIF_CTRLB  _SFR_MEM8(0x03D9)
#define BOOSTIF_LEVEL  _SFR_MEM8(0x03DA)
#define BOOSTIF_CNTHIGH  _SFR_MEM8(0x03DB)
#define BOOSTIF_CNTLOW  _SFR_MEM8(0x03DC)
#define BOOSTIF_TEST  _SFR_MEM8(0x03DD)
#define BOOSTIF_SETTLE  _SFR_MEM8(0x03DE)


/* PWRCTRL - VS PM Control Interface */
#define PWRCTRL_PWRCRVDD2  _SFR_MEM8(0x03E4)


/* TWI (TWIC) - Two-Wire Interface */
#define TWIC_CTRL  _SFR_MEM8(0x03F0)
#define TWIC_MASTER_CTRLA  _SFR_MEM8(0x03F1)
#define TWIC_MASTER_CTRLB  _SFR_MEM8(0x03F2)
#define TWIC_MASTER_CTRLC  _SFR_MEM8(0x03F3)
#define TWIC_MASTER_STATUS  _SFR_MEM8(0x03F4)
#define TWIC_MASTER_BAUD  _SFR_MEM8(0x03F5)
#define TWIC_MASTER_ADDR  _SFR_MEM8(0x03F6)
#define TWIC_MASTER_DATA  _SFR_MEM8(0x03F7)


#define TWIC_SLAVE_CTRLA  _SFR_MEM8(0x03F8)
#define TWIC_SLAVE_CTRLB  _SFR_MEM8(0x03F9)
#define TWIC_SLAVE_STATUS  _SFR_MEM8(0x03FA)
#define TWIC_SLAVE_ADDR  _SFR_MEM8(0x03FB)
#define TWIC_SLAVE_DATA  _SFR_MEM8(0x03FC)
#define TWIC_SLAVE_ADDRMASK  _SFR_MEM8(0x03FD)




/* TIM8_16 (TIMER0) - Timer 8/16 bit */
#define TIMER0_CTRLA  _SFR_MEM8(0x0400)
#define TIMER0_CTRLB  _SFR_MEM8(0x0401)
#define TIMER0_INTMSK  _SFR_MEM8(0x0402)
#define TIMER0_STATUS  _SFR_MEM8(0x0403)
#define TIMER0_TEMP  _SFR_MEM8(0x0404)
#define TIMER0_COUNTL  _SFR_MEM8(0x0408)
#define TIMER0_COUNTH  _SFR_MEM8(0x0409)
#define TIMER0_OCRA  _SFR_MEM8(0x040A)
#define TIMER0_OCRB  _SFR_MEM8(0x040B)


/* TIM8_16 (TIMER1) - Timer 8/16 bit */
#define TIMER1_CTRLA  _SFR_MEM8(0x0410)
#define TIMER1_CTRLB  _SFR_MEM8(0x0411)
#define TIMER1_INTMSK  _SFR_MEM8(0x0412)
#define TIMER1_STATUS  _SFR_MEM8(0x0413)
#define TIMER1_TEMP  _SFR_MEM8(0x0414)
#define TIMER1_COUNTL  _SFR_MEM8(0x0418)
#define TIMER1_COUNTH  _SFR_MEM8(0x0419)
#define TIMER1_OCRA  _SFR_MEM8(0x041A)
#define TIMER1_OCRB  _SFR_MEM8(0x041B)


/* TIMPRESC - Timer Prescaler */
#define TIMPRESC_PRESC  _SFR_MEM8(0x0420)


/* PORT (PORTA) - I/O Ports */
#define PORTA_DIR  _SFR_MEM8(0x0480)
#define PORTA_OUT  _SFR_MEM8(0x0484)
#define PORTA_IN  _SFR_MEM8(0x0488)
#define PORTA_INTCTRL  _SFR_MEM8(0x0489)
#define PORTA_INT0MASK  _SFR_MEM8(0x048A)
#define PORTA_INT1MASK  _SFR_MEM8(0x048B)
#define PORTA_INTFLAGS  _SFR_MEM8(0x048C)
#define PORTA_PIN0CTRL  _SFR_MEM8(0x0490)
#define PORTA_PIN1CTRL  _SFR_MEM8(0x0491)
#define PORTA_PIN2CTRL  _SFR_MEM8(0x0492)
#define PORTA_PIN3CTRL  _SFR_MEM8(0x0493)
#define PORTA_PIN4CTRL  _SFR_MEM8(0x0494)
#define PORTA_PIN5CTRL  _SFR_MEM8(0x0495)
#define PORTA_PIN6CTRL  _SFR_MEM8(0x0496)
#define PORTA_PIN7CTRL  _SFR_MEM8(0x0497)


/* PORT (PORTB) - I/O Ports */
#define PORTB_DIR  _SFR_MEM8(0x04A0)
#define PORTB_OUT  _SFR_MEM8(0x04A4)
#define PORTB_IN  _SFR_MEM8(0x04A8)
#define PORTB_INTCTRL  _SFR_MEM8(0x04A9)
#define PORTB_INT0MASK  _SFR_MEM8(0x04AA)
#define PORTB_INT1MASK  _SFR_MEM8(0x04AB)
#define PORTB_INTFLAGS  _SFR_MEM8(0x04AC)
#define PORTB_PIN0CTRL  _SFR_MEM8(0x04B0)
#define PORTB_PIN1CTRL  _SFR_MEM8(0x04B1)
#define PORTB_PIN2CTRL  _SFR_MEM8(0x04B2)
#define PORTB_PIN3CTRL  _SFR_MEM8(0x04B3)
#define PORTB_PIN4CTRL  _SFR_MEM8(0x04B4)
#define PORTB_PIN5CTRL  _SFR_MEM8(0x04B5)
#define PORTB_PIN6CTRL  _SFR_MEM8(0x04B6)
#define PORTB_PIN7CTRL  _SFR_MEM8(0x04B7)


