gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* ADC_CMN.PRESCALER  bit masks and bit positions */
#define ADC_CMN_PRESCALER_gm  0x07  /* Prescaler Configuration group mask. */
#define ADC_CMN_PRESCALER_gp  0  /* Prescaler Configuration group position. */
#define ADC_CMN_PRESCALER0_bm  (1<<0)  /* Prescaler Configuration bit 0 mask. */
#define ADC_CMN_PRESCALER0_bp  0  /* Prescaler Configuration bit 0 position. */
#define ADC_CMN_PRESCALER1_bm  (1<<1)  /* Prescaler Configuration bit 1 mask. */
#define ADC_CMN_PRESCALER1_bp  1  /* Prescaler Configuration bit 1 position. */
#define ADC_CMN_PRESCALER2_bm  (1<<2)  /* Prescaler Configuration bit 2 mask. */
#define ADC_CMN_PRESCALER2_bp  2  /* Prescaler Configuration bit 2 position. */

/* ADC_CMN.INTCTRL  bit masks and bit positions */
#define ADC_CMN_INTLVL_gm  0x03  /* Interrupt Level group mask. */
#define ADC_CMN_INTLVL_gp  0  /* Interrupt Level group position. */
#define ADC_CMN_INTLVL0_bm  (1<<0)  /* Interrupt Level bit 0 mask. */
#define ADC_CMN_INTLVL0_bp  0  /* Interrupt Level bit 0 position. */
#define ADC_CMN_INTLVL1_bm  (1<<1)  /* Interrupt Level bit 1 mask. */
#define ADC_CMN_INTLVL1_bp  1  /* Interrupt Level bit 1 position. */

/* ADC_CMN.INTSTATUS  bit masks and bit positions */
#define ADC_CMN_SENSETIF_bm  0x01  /* Sensor settling interrupt flag  bit mask. */
#define ADC_CMN_SENSETIF_bp  0  /* Sensor settling interrupt flag  bit position. */

/* ADC_CMN.CHSTATUS  bit masks and bit positions */
#define ADC_CMN_GENCHBUSY_bm  0x01  /* General channel busy bit mask. */
#define ADC_CMN_GENCHBUSY_bp  0  /* General channel busy bit position. */
#define ADC_CMN_SSENSYNCBSY_bm  0x10  /* Sensor settling enable synchronization busy bit mask. */
#define ADC_CMN_SSENSYNCBSY_bp  4  /* Sensor settling enable synchronization busy bit position. */
#define ADC_CMN_ANACLKON_bm  0x20  /* Analog Clock is running bit mask. */
#define ADC_CMN_ANACLKON_bp  5  /* Analog Clock is running bit position. */
#define ADC_CMN_SSBSY_bm  0x40  /* Sensor settling busy bit mask. */
#define ADC_CMN_SSBSY_bp  6  /* Sensor settling busy bit position. */

/* ADC_CMN.THRESHOLD  bit masks and bit positions */
#define ADC_CMN_THRESHOLD_gm  0xFF  /* Threshold value group mask. */
#define ADC_CMN_THRESHOLD_gp  0  /* Threshold value group position. */
#define ADC_CMN_THRESHOLD0_bm  (1<<0)  /* Threshold value bit 0 mask. */
#define ADC_CMN_THRESHOLD0_bp  0  /* Threshold value bit 0 position. */
#define ADC_CMN_THRESHOLD1_bm  (1<<1)  /* Threshold value bit 1 mask. */
#define ADC_CMN_THRESHOLD1_bp  1  /* Threshold value bit 1 position. */
#define ADC_CMN_THRESHOLD2_bm  (1<<2)  /* Threshold value bit 2 mask. */
#define ADC_CMN_THRESHOLD2_bp  2  /* Threshold value bit 2 position. */
#define ADC_CMN_THRESHOLD3_bm  (1<<3)  /* Threshold value bit 3 mask. */
#define ADC_CMN_THRESHOLD3_bp  3  /* Threshold value bit 3 position. */
#define ADC_CMN_THRESHOLD4_bm  (1<<4)  /* Threshold value bit 4 mask. */
#define ADC_CMN_THRESHOLD4_bp  4  /* Threshold value bit 4 position. */
#define ADC_CMN_THRESHOLD5_bm  (1<<5)  /* Threshold value bit 5 mask. */
#define ADC_CMN_THRESHOLD5_bp  5  /* Threshold value bit 5 position. */
#define ADC_CMN_THRESHOLD6_bm  (1<<6)  /* Threshold value bit 6 mask. */
#define ADC_CMN_THRESHOLD6_bp  6  /* Threshold value bit 6 position. */
#define ADC_CMN_THRESHOLD7_bm  (1<<7)  /* Threshold value bit 7 mask. */
#define ADC_CMN_THRESHOLD7_bp  7  /* Threshold value bit 7 position. */

/* ADC_CMN.CAL  bit masks and bit positions */
#define ADC_CMN_CAL_gm  0xFF  /* ADC calibration value group mask. */
#define ADC_CMN_CAL_gp  0  /* ADC calibration value group position. */
#define ADC_CMN_CAL0_bm  (1<<0)  /* ADC calibration value bit 0 mask. */
#define ADC_CMN_CAL0_bp  0  /* ADC calibration value bit 0 position. */
#define ADC_CMN_CAL1_bm  (1<<1)  /* ADC calibration value bit 1 mask. */
#define ADC_CMN_CAL1_bp  1  /* ADC calibration value bit 1 position. */
#define ADC_CMN_CAL2_bm  (1<<2)  /* ADC calibration value bit 2 mask. */
#define ADC_CMN_CAL2_bp  2  /* ADC calibration value bit 2 position. */
#define ADC_CMN_CAL3_bm  (1<<3)  /* ADC calibration value bit 3 mask. */
#define ADC_CMN_CAL3_bp  3  /* ADC calibration value bit 3 position. */
#define ADC_CMN_CAL4_bm  (1<<4)  /* ADC calibration value bit 4 mask. */
#define ADC_CMN_CAL4_bp  4  /* ADC calibration value bit 4 position. */
#define ADC_CMN_CAL5_bm  (1<<5)  /* ADC calibration value bit 5 mask. */
#define ADC_CMN_CAL5_bp  5  /* ADC calibration value bit 5 position. */
#define ADC_CMN_CAL6_bm  (1<<6)  /* ADC calibration value bit 6 mask. */
#define ADC_CMN_CAL6_bp  6  /* ADC calibration value bit 6 position. */
#define ADC_CMN_CAL7_bm  (1<<7)  /* ADC calibration value bit 7 mask. */
#define ADC_CMN_CAL7_bp  7  /* ADC calibration value bit 7 position. */

/* ADC_GEN_CH - ADC General Channel */
/* ADC_GEN_CH.CTRLA  bit masks and bit positions */
#define ADC_GEN_CH_GAIN_gm  0x1C  /* Gain Factor group mask. */
#define ADC_GEN_CH_GAIN_gp  2  /* Gain Factor group position. */
#define ADC_GEN_CH_GAIN0_bm  (1<<2)  /* Gain Factor bit 0 mask. */
#define ADC_GEN_CH_GAIN0_bp  2  /* Gain Factor bit 0 position. */
#define ADC_GEN_CH_GAIN1_bm  (1<<3)  /* Gain Factor bit 1 mask. */
#define ADC_GEN_CH_GAIN1_bp  3  /* Gain Factor bit 1 position. */
#define ADC_GEN_CH_GAIN2_bm  (1<<4)  /* Gain Factor bit 2 mask. */
#define ADC_GEN_CH_GAIN2_bp  4  /* Gain Factor bit 2 position. */
#define ADC_GEN_CH_START_bm  0x80  /* Start Conversion bit mask. */
#define ADC_GEN_CH_START_bp  7  /* Start Conversion bit position. */

/* ADC_GEN_CH.SAMPCTRL  bit masks and bit positions */
#define ADC_GEN_CH_SAMPVAL_gm  0x3F  /* Sampling Time Control group mask. */
#define ADC_GEN_CH_SAMPVAL_gp  0  /* Sampling Time Control group position. */
#define ADC_GEN_CH_SAMPVAL0_bm  (1<<0)  /* Sampling Time Control bit 0 mask. */
#define ADC_GEN_CH_SAMPVAL0_bp  0  /* Sampling Time Control bit 0 position. */
#define ADC_GEN_CH_SAMPVAL1_bm  (1<<1)  /* Sampling Time Control bit 1 mask. */
#define ADC_GEN_CH_SAMPVAL1_bp  1  /* Sampling Time Control bit 1 position. */
#define ADC_GEN_CH_SAMPVAL2_bm  (1<<2)  /* Sampling Time Control bit 2 mask. */
#define ADC_GEN_CH_SAMPVAL2_bp  2  /* Sampling Time Control bit 2 position. */
#define ADC_GEN_CH_SAMPVAL3_bm  (1<<3)  /* Sampling Time Control bit 3 mask. */
#define ADC_GEN_CH_SAMPVAL3_bp  3  /* Sampling Time Control bit 3 position. */
#define ADC_GEN_CH_SAMPVAL4_bm  (1<<4)  /* Sampling Time Control bit 4 mask. */
#define ADC_GEN_CH_SAMPVAL4_bp  4  /* Sampling Time Control bit 4 position. */
#define ADC_GEN_CH_SAMPVAL5_bm  (1<<5)  /* Sampling Time Control bit 5 mask. */
#define ADC_GEN_CH_SAMPVAL5_bp  5  /* Sampling Time Control bit 5 position. */

/* ADC_GEN_CH.MUXCTRL  bit masks and bit positions */
#define ADC_GEN_CH_MUXNEG_gm  0x07  /* MUX Selection on negative ADC input group mask. */
#define ADC_GEN_CH_MUXNEG_gp  0  /* MUX Selection on negative ADC input group position. */
#define ADC_GEN_CH_MUXNEG0_bm  (1<<0)  /* MUX Selection on negative ADC input bit 0 mask. */
#define ADC_GEN_CH_MUXNEG0_bp  0  /* MUX Selection on negative ADC input bit 0 position. */
#define ADC_GEN_CH_MUXNEG1_bm  (1<<1)  /* MUX Selection on negative ADC input bit 1 mask. */
#define ADC_GEN_CH_MUXNEG1_bp  1  /* MUX Selection on negative ADC input bit 1 position. */
#define ADC_GEN_CH_MUXNEG2_bm  (1<<2)  /* MUX Selection on negative ADC input bit 2 mask. */
#define ADC_GEN_CH_MUXNEG2_bp  2  /* MUX Selection on negative ADC input bit 2 position. */
#define ADC_GEN_CH_MUXPOS_gm  0x70  /* MUX Selection on positive ADC input group mask. */
#define ADC_GEN_CH_MUXPOS_gp  4  /* MUX Selection on positive ADC input group position. */
#define ADC_GEN_CH_MUXPOS0_bm  (1<<4)  /* MUX Selection on positive ADC input bit 0 mask. */
#define ADC_GEN_CH_MUXPOS0_bp  4  /* MUX Selection on positive ADC input bit 0 position. */
#define ADC_GEN_CH_MUXPOS1_bm  (1<<5)  /* MUX Selection on positive ADC input bit 1 mask. */
#define ADC_GEN_CH_MUXPOS1_bp  5  /* MUX Selection on positive ADC input bit 1 position. */
#define ADC_GEN_CH_MUXPOS2_bm  (1<<6)  /* MUX Selection on positive ADC input bit 2 mask. */
#define ADC_GEN_CH_MUXPOS2_bp  6  /* MUX Selection on positive ADC input bit 2 position. */

/* ADC_GEN_CH.INTCTRL  bit masks and bit positions */
#define ADC_GEN_CH_INTLVL_gm  0x03  /* Interrupt Level group mask. */
#define ADC_GEN_CH_INTLVL_gp  0  /* Interrupt Level group position. */
#define ADC_GEN_CH_INTLVL0_bm  (1<<0)  /* Interrupt Level bit 0 mask. */
#define ADC_GEN_CH_INTLVL0_bp  0  /* Interrupt Level bit 0 position. */
#define ADC_GEN_CH_INTLVL1_bm  (1<<1)  /* Interrupt Level bit 1 mask. */
#define ADC_GEN_CH_INTLVL1_bp  1  /* Interrupt Level bit 1 position. */

/* ADC_GEN_CH.INTSTATUS  bit masks and bit positions */
#define ADC_GEN_CH_CONVIF_bm  0x01  /* Conversion interrupt flag  bit mask. */
#define ADC_GEN_CH_CONVIF_bp  0  /* Conversion interrupt flag  bit position. */
#define ADC_GEN_CH_ABORTIF_bm  0x02  /* Abort interrupt flag  bit mask. */
#define ADC_GEN_CH_ABORTIF_bp  1  /* Abort interrupt flag  bit position. */
#define ADC_GEN_CH_TXCOLLISION_bm  0x10  /* TX collision flag  bit mask. */
#define ADC_GEN_CH_TXCOLLISION_bp  4  /* TX collision flag  bit position. */

/* ADC_GEN_CH.RESL  bit masks and bit positions */
#define ADC_GEN_CH_RES_gm  0xFF  /* Channel result low byte group mask. */
#define ADC_GEN_CH_RES_gp  0  /* Channel result low byte group position. */
#define ADC_GEN_CH_RES0_bm  (1<<0)  /* Channel result low byte bit 0 mask. */
#define ADC_GEN_CH_RES0_bp  0  /* Channel result low byte bit 0 position. */
#define ADC_GEN_CH_RES1_bm  (1<<1)  /* Channel result low byte bit 1 mask. */
#define ADC_GEN_CH_RES1_bp  1  /* Channel result low byte bit 1 position. */
#define ADC_GEN_CH_RES2_bm  (1<<2)  /* Channel result low byte bit 2 mask. */
#define ADC_GEN_CH_RES2_bp  2  /* Channel result low byte bit 2 position. */
#define ADC_GEN_CH_RES3_bm  (1<<3)  /* Channel result low byte bit 3 mask. */
#define ADC_GEN_CH_RES3_bp  3  /* Channel result low byte bit 3 position. */
#define ADC_GEN_CH_RES4_bm  (1<<4)  /* Channel result low byte bit 4 mask. */
#define ADC_GEN_CH_RES4_bp  4  /* Channel result low byte bit 4 position. */
#define ADC_GEN_CH_RES5_bm  (1<<5)  /* Channel result low byte bit 5 mask. */
#define ADC_GEN_CH_RES5_bp  5  /* Channel result low byte bit 5 position. */
#define ADC_GEN_CH_RES6_bm  (1<<6)  /* Channel result low byte bit 6 mask. */
#define ADC_GEN_CH_RES6_bp  6  /* Channel result low byte bit 6 position. */
#define ADC_GEN_CH_RES7_bm  (1<<7)  /* Channel result low byte bit 7 mask. */
#define ADC_GEN_CH_RES7_bp  7  /* Channel result low byte bit 7 position. */

/* ADC_GEN_CH.RESH  bit masks and bit positions */
/* ADC_GEN_CH_RES  is already defined. */

/* ADC_GEN_CH.REFCTRL  bit masks and bit positions */
#define ADC_GEN_CH_TEMPREFEN_bm  0x01  /* Temperature reference enable bit mask. */
#define ADC_GEN_CH_TEMPREFEN_bp  0  /* Temperature reference enable bit position. */
#define ADC_GEN_CH_REFGENSEL_gm  0x0E  /* Reference generator select group mask. */
#define ADC_GEN_CH_REFGENSEL_gp  1  /* Reference generator select group position. */
#define ADC_GEN_CH_REFGENSEL0_bm  (1<<1)  /* Reference generator select bit 0 mask. */
#define ADC_GEN_CH_REFGENSEL0_bp  1  /* Reference generator select bit 0 position. */
#define ADC_GEN_CH_REFGENSEL1_bm  (1<<2)  /* Reference generator select bit 1 mask. */
#define ADC_GEN_CH_REFGENSEL1_bp  2  /* Reference generator select bit 1 position. */
#define ADC_GEN_CH_REFGENSEL2_bm  (1<<3)  /* Reference generator select bit 2 mask. */
#define ADC_GEN_CH_REFGENSEL2_bp  3  /* Reference generator select bit 2 position. */
#define ADC_GEN_CH_REFSEL_gm  0x70  /* Channel reference select group mask. */
#define ADC_GEN_CH_REFSEL_gp  4  /* Channel reference select group position. */
#define ADC_GEN_CH_REFSEL0_bm  (1<<4)  /* Channel reference select bit 0 mask. */
#define ADC_GEN_CH_REFSEL0_bp  4  /* Channel reference select bit 0 position. */
#define ADC_GEN_CH_REFSEL1_bm  (1<<5)  /* Channel reference select bit 1 mask. */
#define ADC_GEN_CH_REFSEL1_bp  5  /* Channel reference select bit 1 position. */
#define ADC_GEN_CH_REFSEL2_bm  (1<<6)  /* Channel reference select bit 2 mask. */
#define ADC_GEN_CH_REFSEL2_bp  6  /* Channel reference select bit 2 position. */

