gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* ADC_GEN_CH.RESHTMP  bit masks and bit positions */
#define ADC_GEN_CH_RESHTMP_gm  0xFF  /* Temporary channel result high byte group mask. */
#define ADC_GEN_CH_RESHTMP_gp  0  /* Temporary channel result high byte group position. */
#define ADC_GEN_CH_RESHTMP0_bm  (1<<0)  /* Temporary channel result high byte bit 0 mask. */
#define ADC_GEN_CH_RESHTMP0_bp  0  /* Temporary channel result high byte bit 0 position. */
#define ADC_GEN_CH_RESHTMP1_bm  (1<<1)  /* Temporary channel result high byte bit 1 mask. */
#define ADC_GEN_CH_RESHTMP1_bp  1  /* Temporary channel result high byte bit 1 position. */
#define ADC_GEN_CH_RESHTMP2_bm  (1<<2)  /* Temporary channel result high byte bit 2 mask. */
#define ADC_GEN_CH_RESHTMP2_bp  2  /* Temporary channel result high byte bit 2 position. */
#define ADC_GEN_CH_RESHTMP3_bm  (1<<3)  /* Temporary channel result high byte bit 3 mask. */
#define ADC_GEN_CH_RESHTMP3_bp  3  /* Temporary channel result high byte bit 3 position. */
#define ADC_GEN_CH_RESHTMP4_bm  (1<<4)  /* Temporary channel result high byte bit 4 mask. */
#define ADC_GEN_CH_RESHTMP4_bp  4  /* Temporary channel result high byte bit 4 position. */
#define ADC_GEN_CH_RESHTMP5_bm  (1<<5)  /* Temporary channel result high byte bit 5 mask. */
#define ADC_GEN_CH_RESHTMP5_bp  5  /* Temporary channel result high byte bit 5 position. */
#define ADC_GEN_CH_RESHTMP6_bm  (1<<6)  /* Temporary channel result high byte bit 6 mask. */
#define ADC_GEN_CH_RESHTMP6_bp  6  /* Temporary channel result high byte bit 6 position. */
#define ADC_GEN_CH_RESHTMP7_bm  (1<<7)  /* Temporary channel result high byte bit 7 mask. */
#define ADC_GEN_CH_RESHTMP7_bp  7  /* Temporary channel result high byte bit 7 position. */

/* BANDGAP - Bandgap */
/* BANDGAP.CTRL  bit masks and bit positions */
#define BANDGAP_SAMPTIMOFF_gm  0x07  /* Sample mode off timing group mask. */
#define BANDGAP_SAMPTIMOFF_gp  0  /* Sample mode off timing group position. */
#define BANDGAP_SAMPTIMOFF0_bm  (1<<0)  /* Sample mode off timing bit 0 mask. */
#define BANDGAP_SAMPTIMOFF0_bp  0  /* Sample mode off timing bit 0 position. */
#define BANDGAP_SAMPTIMOFF1_bm  (1<<1)  /* Sample mode off timing bit 1 mask. */
#define BANDGAP_SAMPTIMOFF1_bp  1  /* Sample mode off timing bit 1 position. */
#define BANDGAP_SAMPTIMOFF2_bm  (1<<2)  /* Sample mode off timing bit 2 mask. */
#define BANDGAP_SAMPTIMOFF2_bp  2  /* Sample mode off timing bit 2 position. */
#define BANDGAP_SBSY_bm  0x08  /* Synchronization busy bit mask. */
#define BANDGAP_SBSY_bp  3  /* Synchronization busy bit position. */
#define BANDGAP_SAMPTIMON_gm  0xF0  /* Sample mode on timing group mask. */
#define BANDGAP_SAMPTIMON_gp  4  /* Sample mode on timing group position. */
#define BANDGAP_SAMPTIMON0_bm  (1<<4)  /* Sample mode on timing bit 0 mask. */
#define BANDGAP_SAMPTIMON0_bp  4  /* Sample mode on timing bit 0 position. */
#define BANDGAP_SAMPTIMON1_bm  (1<<5)  /* Sample mode on timing bit 1 mask. */
#define BANDGAP_SAMPTIMON1_bp  5  /* Sample mode on timing bit 1 position. */
#define BANDGAP_SAMPTIMON2_bm  (1<<6)  /* Sample mode on timing bit 2 mask. */
#define BANDGAP_SAMPTIMON2_bp  6  /* Sample mode on timing bit 2 position. */
#define BANDGAP_SAMPTIMON3_bm  (1<<7)  /* Sample mode on timing bit 3 mask. */
#define BANDGAP_SAMPTIMON3_bp  7  /* Sample mode on timing bit 3 position. */

/* BIASCTRL - BIASCTRL */
/* BIASCTRL.CTRL  bit masks and bit positions */
#define BIASCTRL_BIAS1uA_bm  0x01  /* BIAS 1uA Auto bit mask. */
#define BIASCTRL_BIAS1uA_bp  0  /* BIAS 1uA Auto bit position. */

/* BOOSTIF - Boost Converter Interface */
/* BOOSTIF.CTRLA  bit masks and bit positions */
#define BOOSTIF_EN_bm  0x01  /* Boost Converter Enable bit mask. */
#define BOOSTIF_EN_bp  0  /* Boost Converter Enable bit position. */
#define BOOSTIF_REFRESH_gm  0x0E  /* Refresh Interval group mask. */
#define BOOSTIF_REFRESH_gp  1  /* Refresh Interval group position. */
#define BOOSTIF_REFRESH0_bm  (1<<1)  /* Refresh Interval bit 0 mask. */
#define BOOSTIF_REFRESH0_bp  1  /* Refresh Interval bit 0 position. */
#define BOOSTIF_REFRESH1_bm  (1<<2)  /* Refresh Interval bit 1 mask. */
#define BOOSTIF_REFRESH1_bp  2  /* Refresh Interval bit 1 position. */
#define BOOSTIF_REFRESH2_bm  (1<<3)  /* Refresh Interval bit 2 mask. */
#define BOOSTIF_REFRESH2_bp  3  /* Refresh Interval bit 2 position. */
#define BOOSTIF_SLOWSTART_bm  0x10  /* Enable Slowstart Mode bit mask. */
#define BOOSTIF_SLOWSTART_bp  4  /* Enable Slowstart Mode bit position. */
#define BOOSTIF_OUTDIS_bm  0x20  /* Output Disable bit mask. */
#define BOOSTIF_OUTDIS_bp  5  /* Output Disable bit position. */
#define BOOSTIF_WAITFINISH_bm  0x40  /* Wait Finish Enable bit mask. */
#define BOOSTIF_WAITFINISH_bp  6  /* Wait Finish Enable bit position. */

/* BOOSTIF.CTRLB  bit masks and bit positions */
#define BOOSTIF_SLOWSTARTCTRL_gm  0x07  /* Slow start sequence duration group mask. */
#define BOOSTIF_SLOWSTARTCTRL_gp  0  /* Slow start sequence duration group position. */
#define BOOSTIF_SLOWSTARTCTRL0_bm  (1<<0)  /* Slow start sequence duration bit 0 mask. */
#define BOOSTIF_SLOWSTARTCTRL0_bp  0  /* Slow start sequence duration bit 0 position. */
#define BOOSTIF_SLOWSTARTCTRL1_bm  (1<<1)  /* Slow start sequence duration bit 1 mask. */
#define BOOSTIF_SLOWSTARTCTRL1_bp  1  /* Slow start sequence duration bit 1 position. */
#define BOOSTIF_SLOWSTARTCTRL2_bm  (1<<2)  /* Slow start sequence duration bit 2 mask. */
#define BOOSTIF_SLOWSTARTCTRL2_bp  2  /* Slow start sequence duration bit 2 position. */

/* BOOSTIF.LEVEL  bit masks and bit positions */
#define BOOSTIF_LEVEL_gm  0x1F  /* Boost Converter Voltage Level group mask. */
#define BOOSTIF_LEVEL_gp  0  /* Boost Converter Voltage Level group position. */
#define BOOSTIF_LEVEL0_bm  (1<<0)  /* Boost Converter Voltage Level bit 0 mask. */
#define BOOSTIF_LEVEL0_bp  0  /* Boost Converter Voltage Level bit 0 position. */
#define BOOSTIF_LEVEL1_bm  (1<<1)  /* Boost Converter Voltage Level bit 1 mask. */
#define BOOSTIF_LEVEL1_bp  1  /* Boost Converter Voltage Level bit 1 position. */
#define BOOSTIF_LEVEL2_bm  (1<<2)  /* Boost Converter Voltage Level bit 2 mask. */
#define BOOSTIF_LEVEL2_bp  2  /* Boost Converter Voltage Level bit 2 position. */
#define BOOSTIF_LEVEL3_bm  (1<<3)  /* Boost Converter Voltage Level bit 3 mask. */
#define BOOSTIF_LEVEL3_bp  3  /* Boost Converter Voltage Level bit 3 position. */
#define BOOSTIF_LEVEL4_bm  (1<<4)  /* Boost Converter Voltage Level bit 4 mask. */
#define BOOSTIF_LEVEL4_bp  4  /* Boost Converter Voltage Level bit 4 position. */

/* BOOSTIF.CNTHIGH  bit masks and bit positions */
#define BOOSTIF_CNTHIGH_gm  0x7F  /* High-period Cycle Count group mask. */
#define BOOSTIF_CNTHIGH_gp  0  /* High-period Cycle Count group position. */
#define BOOSTIF_CNTHIGH0_bm  (1<<0)  /* High-period Cycle Count bit 0 mask. */
#define BOOSTIF_CNTHIGH0_bp  0  /* High-period Cycle Count bit 0 position. */
#define BOOSTIF_CNTHIGH1_bm  (1<<1)  /* High-period Cycle Count bit 1 mask. */
#define BOOSTIF_CNTHIGH1_bp  1  /* High-period Cycle Count bit 1 position. */
#define BOOSTIF_CNTHIGH2_bm  (1<<2)  /* High-period Cycle Count bit 2 mask. */
#define BOOSTIF_CNTHIGH2_bp  2  /* High-period Cycle Count bit 2 position. */
#define BOOSTIF_CNTHIGH3_bm  (1<<3)  /* High-period Cycle Count bit 3 mask. */
#define BOOSTIF_CNTHIGH3_bp  3  /* High-period Cycle Count bit 3 position. */
#define BOOSTIF_CNTHIGH4_bm  (1<<4)  /* High-period Cycle Count bit 4 mask. */
#define BOOSTIF_CNTHIGH4_bp  4  /* High-period Cycle Count bit 4 position. */
#define BOOSTIF_CNTHIGH5_bm  (1<<5)  /* High-period Cycle Count bit 5 mask. */
#define BOOSTIF_CNTHIGH5_bp  5  /* High-period Cycle Count bit 5 position. */
#define BOOSTIF_CNTHIGH6_bm  (1<<6)  /* High-period Cycle Count bit 6 mask. */
#define BOOSTIF_CNTHIGH6_bp  6  /* High-period Cycle Count bit 6 position. */

/* BOOSTIF.CNTLOW  bit masks and bit positions */
#define BOOSTIF_CNTLOW_gm  0x7F  /* Low-period Cycle Count group mask. */
#define BOOSTIF_CNTLOW_gp  0  /* Low-period Cycle Count group position. */
#define BOOSTIF_CNTLOW0_bm  (1<<0)  /* Low-period Cycle Count bit 0 mask. */
#define BOOSTIF_CNTLOW0_bp  0  /* Low-period Cycle Count bit 0 position. */
#define BOOSTIF_CNTLOW1_bm  (1<<1)  /* Low-period Cycle Count bit 1 mask. */
#define BOOSTIF_CNTLOW1_bp  1  /* Low-period Cycle Count bit 1 position. */
#define BOOSTIF_CNTLOW2_bm  (1<<2)  /* Low-period Cycle Count bit 2 mask. */
#define BOOSTIF_CNTLOW2_bp  2  /* Low-period Cycle Count bit 2 position. */
#define BOOSTIF_CNTLOW3_bm  (1<<3)  /* Low-period Cycle Count bit 3 mask. */
#define BOOSTIF_CNTLOW3_bp  3  /* Low-period Cycle Count bit 3 position. */
#define BOOSTIF_CNTLOW4_bm  (1<<4)  /* Low-period Cycle Count bit 4 mask. */
#define BOOSTIF_CNTLOW4_bp  4  /* Low-period Cycle Count bit 4 position. */
#define BOOSTIF_CNTLOW5_bm  (1<<5)  /* Low-period Cycle Count bit 5 mask. */
#define BOOSTIF_CNTLOW5_bp  5  /* Low-period Cycle Count bit 5 position. */
#define BOOSTIF_CNTLOW6_bm  (1<<6)  /* Low-period Cycle Count bit 6 mask. */
#define BOOSTIF_CNTLOW6_bp  6  /* Low-period Cycle Count bit 6 position. */

/* BOOSTIF.TEST  bit masks and bit positions */
#define BOOSTIF_RAW_bm  0x01  /* NFET switch use analog output bit mask. */
#define BOOSTIF_RAW_bp  0  /* NFET switch use analog output bit position. */
#define BOOSTIF_ABOVE_bm  0x02  /* Regulated voltage level above configured level bit mask. */
#define BOOSTIF_ABOVE_bp  1  /* Regulated voltage level above configured level bit position. */
#define BOOSTIF_PINOD_bm  0x04  /* Pin Override Disable bit mask. */
#define BOOSTIF_PINOD_bp  2  /* Pin Override Disable bit position. */

/* BOOSTIF.SETTLE  bit masks and bit positions */
#define BOOSTIF_SETTLE_gm  0x0F  /* Analog Settle Time group mask. */
#define BOOSTIF_SETTLE_gp  0  /* Analog Settle Time group position. */
#define BOOSTIF_SETTLE0_bm  (1<<0)  /* Analog Settle Time bit 0 mask. */
#define BOOSTIF_SETTLE0_bp  0  /* Analog Settle Time bit 0 position. */
#define BOOSTIF_SETTLE1_bm  (1<<1)  /* Analog Settle Time bit 1 mask. */
#define BOOSTIF_SETTLE1_bp  1  /* Analog Settle Time bit 1 position. */
#define BOOSTIF_SETTLE2_bm  (1<<2)  /* Analog Settle Time bit 2 mask. */
#define BOOSTIF_SETTLE2_bp  2  /* Analog Settle Time bit 2 position. */
#define BOOSTIF_SETTLE3_bm  (1<<3)  /* Analog Settle Time bit 3 mask. */
#define BOOSTIF_SETTLE3_bp  3  /* Analog Settle Time bit 3 position. */

/* CLK - Clock System */
/* CLK.CLKPSR  bit masks and bit positions */
#define CLK_CLKPS_gm  0x03  /* Clock Prescale Divide Factor group mask. */
#define CLK_CLKPS_gp  0  /* Clock Prescale Divide Factor group position. */
#define CLK_CLKPS0_bm  (1<<0)  /* Clock Prescale Divide Factor bit 0 mask. */
#define CLK_CLKPS0_bp  0  /* Clock Prescale Divide Factor bit 0 position. */
#define CLK_CLKPS1_bm  (1<<1)  /* Clock Prescale Divide Factor bit 1 mask. */
#define CLK_CLKPS1_bp  1  /* Clock Prescale Divide Factor bit 1 position. */

/* CLK.CLKSLR  bit masks and bit positions */
#define CLK_CLKSL_bm  0x01  /* Clock Settings Lock bit mask. */
#define CLK_CLKSL_bp  0  /* Clock Settings Lock bit position. */

/* CLK.FRCCALL  bit masks and bit positions */
#define CLK_CAL_gm  0xFF  /* Fast RC Calibration group mask. */
#define CLK_CAL_gp  0  /* Fast RC Calibration group position. */
#define CLK_CAL0_bm  (1<<0)  /* Fast RC Calibration bit 0 mask. */
#define CLK_CAL0_bp  0  /* Fast RC Calibration bit 0 position. */
#define CLK_CAL1_bm  (1<<1)  /* Fast RC Calibration bit 1 mask. */
#define CLK_CAL1_bp  1  /* Fast RC Calibration bit 1 position. */
#define CLK_CAL2_bm  (1<<2)  /* Fast RC Calibration bit 2 mask. */
#define CLK_CAL2_bp  2  /* Fast RC Calibration bit 2 position. */
#define CLK_CAL3_bm  (1<<3)  /* Fast RC Calibration bit 3 mask. */
#define CLK_CAL3_bp  3  /* Fast RC Calibration bit 3 position. */
#define CLK_CAL4_bm  (1<<4)  /* Fast RC Calibration bit 4 mask. */
#define CLK_CAL4_bp  4  /* Fast RC Calibration bit 4 position. */
#define CLK_CAL5_bm  (1<<5)  /* Fast RC Calibration bit 5 mask. */
#define CLK_CAL5_bp  5  /* Fast RC Calibration bit 5 position. */
#define CLK_CAL6_bm  (1<<6)  /* Fast RC Calibration bit 6 mask. */
#define CLK_CAL6_bp  6  /* Fast RC Calibration bit 6 position. */
#define CLK_CAL7_bm  (1<<7)  /* Fast RC Calibration bit 7 mask. */
#define CLK_CAL7_bp  7  /* Fast RC Calibration bit 7 position. */

/* CLK.FRCCALH  bit masks and bit positions */
/* CLK_CAL  is already defined. */

