gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* CLK.ULPRCCALL  bit masks and bit positions */
/* CLK_CAL  is already defined. */

/* CLK.ULPRCCALH  bit masks and bit positions */
/* CLK_CAL  is already defined. */

/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP7_bp  7  /* CCP signature bit 7 position. */

/* CPU.RAMPD  bit masks and bit positions */
#define CPU_RAMPD_gm  0xFF  /* Extended Direct Addressing bits group mask. */
#define CPU_RAMPD_gp  0  /* Extended Direct Addressing bits group position. */
#define CPU_RAMPD0_bm  (1<<0)  /* Extended Direct Addressing bits bit 0 mask. */
#define CPU_RAMPD0_bp  0  /* Extended Direct Addressing bits bit 0 position. */
#define CPU_RAMPD1_bm  (1<<1)  /* Extended Direct Addressing bits bit 1 mask. */
#define CPU_RAMPD1_bp  1  /* Extended Direct Addressing bits bit 1 position. */
#define CPU_RAMPD2_bm  (1<<2)  /* Extended Direct Addressing bits bit 2 mask. */
#define CPU_RAMPD2_bp  2  /* Extended Direct Addressing bits bit 2 position. */
#define CPU_RAMPD3_bm  (1<<3)  /* Extended Direct Addressing bits bit 3 mask. */
#define CPU_RAMPD3_bp  3  /* Extended Direct Addressing bits bit 3 position. */
#define CPU_RAMPD4_bm  (1<<4)  /* Extended Direct Addressing bits bit 4 mask. */
#define CPU_RAMPD4_bp  4  /* Extended Direct Addressing bits bit 4 position. */
#define CPU_RAMPD5_bm  (1<<5)  /* Extended Direct Addressing bits bit 5 mask. */
#define CPU_RAMPD5_bp  5  /* Extended Direct Addressing bits bit 5 position. */
#define CPU_RAMPD6_bm  (1<<6)  /* Extended Direct Addressing bits bit 6 mask. */
#define CPU_RAMPD6_bp  6  /* Extended Direct Addressing bits bit 6 position. */
#define CPU_RAMPD7_bm  (1<<7)  /* Extended Direct Addressing bits bit 7 mask. */
#define CPU_RAMPD7_bp  7  /* Extended Direct Addressing bits bit 7 position. */

/* CPU.RAMPX  bit masks and bit positions */
#define CPU_RAMPX_gm  0xFF  /* Extended X-pointer Address bits group mask. */
#define CPU_RAMPX_gp  0  /* Extended X-pointer Address bits group position. */
#define CPU_RAMPX0_bm  (1<<0)  /* Extended X-pointer Address bits bit 0 mask. */
#define CPU_RAMPX0_bp  0  /* Extended X-pointer Address bits bit 0 position. */
#define CPU_RAMPX1_bm  (1<<1)  /* Extended X-pointer Address bits bit 1 mask. */
#define CPU_RAMPX1_bp  1  /* Extended X-pointer Address bits bit 1 position. */
#define CPU_RAMPX2_bm  (1<<2)  /* Extended X-pointer Address bits bit 2 mask. */
#define CPU_RAMPX2_bp  2  /* Extended X-pointer Address bits bit 2 position. */
#define CPU_RAMPX3_bm  (1<<3)  /* Extended X-pointer Address bits bit 3 mask. */
#define CPU_RAMPX3_bp  3  /* Extended X-pointer Address bits bit 3 position. */
#define CPU_RAMPX4_bm  (1<<4)  /* Extended X-pointer Address bits bit 4 mask. */
#define CPU_RAMPX4_bp  4  /* Extended X-pointer Address bits bit 4 position. */
#define CPU_RAMPX5_bm  (1<<5)  /* Extended X-pointer Address bits bit 5 mask. */
#define CPU_RAMPX5_bp  5  /* Extended X-pointer Address bits bit 5 position. */
#define CPU_RAMPX6_bm  (1<<6)  /* Extended X-pointer Address bits bit 6 mask. */
#define CPU_RAMPX6_bp  6  /* Extended X-pointer Address bits bit 6 position. */
#define CPU_RAMPX7_bm  (1<<7)  /* Extended X-pointer Address bits bit 7 mask. */
#define CPU_RAMPX7_bp  7  /* Extended X-pointer Address bits bit 7 position. */

/* CPU.RAMPY  bit masks and bit positions */
#define CPU_RAMPY_gm  0xFF  /* Extended Y-pointer Address bits group mask. */
#define CPU_RAMPY_gp  0  /* Extended Y-pointer Address bits group position. */
#define CPU_RAMPY0_bm  (1<<0)  /* Extended Y-pointer Address bits bit 0 mask. */
#define CPU_RAMPY0_bp  0  /* Extended Y-pointer Address bits bit 0 position. */
#define CPU_RAMPY1_bm  (1<<1)  /* Extended Y-pointer Address bits bit 1 mask. */
#define CPU_RAMPY1_bp  1  /* Extended Y-pointer Address bits bit 1 position. */
#define CPU_RAMPY2_bm  (1<<2)  /* Extended Y-pointer Address bits bit 2 mask. */
#define CPU_RAMPY2_bp  2  /* Extended Y-pointer Address bits bit 2 position. */
#define CPU_RAMPY3_bm  (1<<3)  /* Extended Y-pointer Address bits bit 3 mask. */
#define CPU_RAMPY3_bp  3  /* Extended Y-pointer Address bits bit 3 position. */
#define CPU_RAMPY4_bm  (1<<4)  /* Extended Y-pointer Address bits bit 4 mask. */
#define CPU_RAMPY4_bp  4  /* Extended Y-pointer Address bits bit 4 position. */
#define CPU_RAMPY5_bm  (1<<5)  /* Extended Y-pointer Address bits bit 5 mask. */
#define CPU_RAMPY5_bp  5  /* Extended Y-pointer Address bits bit 5 position. */
#define CPU_RAMPY6_bm  (1<<6)  /* Extended Y-pointer Address bits bit 6 mask. */
#define CPU_RAMPY6_bp  6  /* Extended Y-pointer Address bits bit 6 position. */
#define CPU_RAMPY7_bm  (1<<7)  /* Extended Y-pointer Address bits bit 7 mask. */
#define CPU_RAMPY7_bp  7  /* Extended Y-pointer Address bits bit 7 position. */

/* CPU.RAMPZ  bit masks and bit positions */
#define CPU_RAMPZ_gm  0xFF  /* Extended Z-pointer Address bits group mask. */
#define CPU_RAMPZ_gp  0  /* Extended Z-pointer Address bits group position. */
#define CPU_RAMPZ0_bm  (1<<0)  /* Extended Z-pointer Address bits bit 0 mask. */
#define CPU_RAMPZ0_bp  0  /* Extended Z-pointer Address bits bit 0 position. */
#define CPU_RAMPZ1_bm  (1<<1)  /* Extended Z-pointer Address bits bit 1 mask. */
#define CPU_RAMPZ1_bp  1  /* Extended Z-pointer Address bits bit 1 position. */
#define CPU_RAMPZ2_bm  (1<<2)  /* Extended Z-pointer Address bits bit 2 mask. */
#define CPU_RAMPZ2_bp  2  /* Extended Z-pointer Address bits bit 2 position. */
#define CPU_RAMPZ3_bm  (1<<3)  /* Extended Z-pointer Address bits bit 3 mask. */
#define CPU_RAMPZ3_bp  3  /* Extended Z-pointer Address bits bit 3 position. */
#define CPU_RAMPZ4_bm  (1<<4)  /* Extended Z-pointer Address bits bit 4 mask. */
#define CPU_RAMPZ4_bp  4  /* Extended Z-pointer Address bits bit 4 position. */
#define CPU_RAMPZ5_bm  (1<<5)  /* Extended Z-pointer Address bits bit 5 mask. */
#define CPU_RAMPZ5_bp  5  /* Extended Z-pointer Address bits bit 5 position. */
#define CPU_RAMPZ6_bm  (1<<6)  /* Extended Z-pointer Address bits bit 6 mask. */
#define CPU_RAMPZ6_bp  6  /* Extended Z-pointer Address bits bit 6 position. */
#define CPU_RAMPZ7_bm  (1<<7)  /* Extended Z-pointer Address bits bit 7 mask. */
#define CPU_RAMPZ7_bp  7  /* Extended Z-pointer Address bits bit 7 position. */

/* CPU.EIND  bit masks and bit positions */
#define CPU_EIND_gm  0xFF  /* Extended Indirect Address bits group mask. */
#define CPU_EIND_gp  0  /* Extended Indirect Address bits group position. */
#define CPU_EIND0_bm  (1<<0)  /* Extended Indirect Address bits bit 0 mask. */
#define CPU_EIND0_bp  0  /* Extended Indirect Address bits bit 0 position. */
#define CPU_EIND1_bm  (1<<1)  /* Extended Indirect Address bits bit 1 mask. */
#define CPU_EIND1_bp  1  /* Extended Indirect Address bits bit 1 position. */
#define CPU_EIND2_bm  (1<<2)  /* Extended Indirect Address bits bit 2 mask. */
#define CPU_EIND2_bp  2  /* Extended Indirect Address bits bit 2 position. */
#define CPU_EIND3_bm  (1<<3)  /* Extended Indirect Address bits bit 3 mask. */
#define CPU_EIND3_bp  3  /* Extended Indirect Address bits bit 3 position. */
#define CPU_EIND4_bm  (1<<4)  /* Extended Indirect Address bits bit 4 mask. */
#define CPU_EIND4_bp  4  /* Extended Indirect Address bits bit 4 position. */
#define CPU_EIND5_bm  (1<<5)  /* Extended Indirect Address bits bit 5 mask. */
#define CPU_EIND5_bp  5  /* Extended Indirect Address bits bit 5 position. */
#define CPU_EIND6_bm  (1<<6)  /* Extended Indirect Address bits bit 6 mask. */
#define CPU_EIND6_bp  6  /* Extended Indirect Address bits bit 6 position. */
#define CPU_EIND7_bm  (1<<7)  /* Extended Indirect Address bits bit 7 mask. */
#define CPU_EIND7_bp  7  /* Extended Indirect Address bits bit 7 position. */

/* CPU.SPL  bit masks and bit positions */
#define CPU_SP_gm  0xFF  /* Stack Pointer Register Low bits group mask. */
#define CPU_SP_gp  0  /* Stack Pointer Register Low bits group position. */
#define CPU_SP0_bm  (1<<0)  /* Stack Pointer Register Low bits bit 0 mask. */
#define CPU_SP0_bp  0  /* Stack Pointer Register Low bits bit 0 position. */
#define CPU_SP1_bm  (1<<1)  /* Stack Pointer Register Low bits bit 1 mask. */
#define CPU_SP1_bp  1  /* Stack Pointer Register Low bits bit 1 position. */
#define CPU_SP2_bm  (1<<2)  /* Stack Pointer Register Low bits bit 2 mask. */
#define CPU_SP2_bp  2  /* Stack Pointer Register Low bits bit 2 position. */
#define CPU_SP3_bm  (1<<3)  /* Stack Pointer Register Low bits bit 3 mask. */
#define CPU_SP3_bp  3  /* Stack Pointer Register Low bits bit 3 position. */
#define CPU_SP4_bm  (1<<4)  /* Stack Pointer Register Low bits bit 4 mask. */
#define CPU_SP4_bp  4  /* Stack Pointer Register Low bits bit 4 position. */
#define CPU_SP5_bm  (1<<5)  /* Stack Pointer Register Low bits bit 5 mask. */
#define CPU_SP5_bp  5  /* Stack Pointer Register Low bits bit 5 position. */
#define CPU_SP6_bm  (1<<6)  /* Stack Pointer Register Low bits bit 6 mask. */
#define CPU_SP6_bp  6  /* Stack Pointer Register Low bits bit 6 position. */
#define CPU_SP7_bm  (1<<7)  /* Stack Pointer Register Low bits bit 7 mask. */
#define CPU_SP7_bp  7  /* Stack Pointer Register Low bits bit 7 position. */

/* CPU.SPH  bit masks and bit positions */
/* CPU_SP  is already defined. */

/* CPU.SREG  bit masks and bit positions */
#define CPU_C_bm  0x01  /* Carry Flag bit mask. */
#define CPU_C_bp  0  /* Carry Flag bit position. */
#define CPU_Z_bm  0x02  /* Zero Flag bit mask. */
#define CPU_Z_bp  1  /* Zero Flag bit position. */
#define CPU_N_bm  0x04  /* Negative Flag bit mask. */
#define CPU_N_bp  2  /* Negative Flag bit position. */
#define CPU_V_bm  0x08  /* Two's Complement Overflow Flag bit mask. */
#define CPU_V_bp  3  /* Two's Complement Overflow Flag bit position. */
#define CPU_S_bm  0x10  /* N Exclusive Or V Flag bit mask. */
#define CPU_S_bp  4  /* N Exclusive Or V Flag bit position. */
#define CPU_H_bm  0x20  /* Half Carry Flag bit mask. */
#define CPU_H_bp  5  /* Half Carry Flag bit position. */
#define CPU_T_bm  0x40  /* Transfer Bit bit mask. */
#define CPU_T_bp  6  /* Transfer Bit bit position. */
#define CPU_I_bm  0x80  /* Global Interrupt Enable Flag bit mask. */
#define CPU_I_bp  7  /* Global Interrupt Enable Flag bit position. */

/* CRC4 - Cyclic Redundancy Checker */
/* CRC4.DATAIN  bit masks and bit positions */
#define CRC4_DATAIN_gm  0xFF  /* Input data group mask. */
#define CRC4_DATAIN_gp  0  /* Input data group position. */
#define CRC4_DATAIN0_bm  (1<<0)  /* Input data bit 0 mask. */
#define CRC4_DATAIN0_bp  0  /* Input data bit 0 position. */
#define CRC4_DATAIN1_bm  (1<<1)  /* Input data bit 1 mask. */
#define CRC4_DATAIN1_bp  1  /* Input data bit 1 position. */
#define CRC4_DATAIN2_bm  (1<<2)  /* Input data bit 2 mask. */
#define CRC4_DATAIN2_bp  2  /* Input data bit 2 position. */
#define CRC4_DATAIN3_bm  (1<<3)  /* Input data bit 3 mask. */
#define CRC4_DATAIN3_bp  3  /* Input data bit 3 position. */
#define CRC4_DATAIN4_bm  (1<<4)  /* Input data bit 4 mask. */
#define CRC4_DATAIN4_bp  4  /* Input data bit 4 position. */
#define CRC4_DATAIN5_bm  (1<<5)  /* Input data bit 5 mask. */
#define CRC4_DATAIN5_bp  5  /* Input data bit 5 position. */
#define CRC4_DATAIN6_bm  (1<<6)  /* Input data bit 6 mask. */
#define CRC4_DATAIN6_bp  6  /* Input data bit 6 position. */
#define CRC4_DATAIN7_bm  (1<<7)  /* Input data bit 7 mask. */
#define CRC4_DATAIN7_bp  7  /* Input data bit 7 position. */

/* CRC4.CHECKSUM  bit masks and bit positions */
#define CRC4_CHECKSUM_gm  0x0F  /* Checsum group mask. */
#define CRC4_CHECKSUM_gp  0  /* Checsum group position. */
#define CRC4_CHECKSUM0_bm  (1<<0)  /* Checsum bit 0 mask. */
#define CRC4_CHECKSUM0_bp  0  /* Checsum bit 0 position. */
#define CRC4_CHECKSUM1_bm  (1<<1)  /* Checsum bit 1 mask. */
#define CRC4_CHECKSUM1_bp  1  /* Checsum bit 1 position. */
#define CRC4_CHECKSUM2_bm  (1<<2)  /* Checsum bit 2 mask. */
#define CRC4_CHECKSUM2_bp  2  /* Checsum bit 2 position. */
#define CRC4_CHECKSUM3_bm  (1<<3)  /* Checsum bit 3 mask. */
#define CRC4_CHECKSUM3_bp  3  /* Checsum bit 3 position. */

