gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* GPIO.GPIOR3  bit masks and bit positions */
/* GPIO_GPIO  is already defined. */

/* LDO - LDO */
/* LDO.CTRL  bit masks and bit positions */
#define LDO_MODE_gm  0x03  /* Mode Configuration group mask. */
#define LDO_MODE_gp  0  /* Mode Configuration group position. */
#define LDO_MODE0_bm  (1<<0)  /* Mode Configuration bit 0 mask. */
#define LDO_MODE0_bp  0  /* Mode Configuration bit 0 position. */
#define LDO_MODE1_bm  (1<<1)  /* Mode Configuration bit 1 mask. */
#define LDO_MODE1_bp  1  /* Mode Configuration bit 1 position. */
#define LDO_SBSY_bm  0x80  /* Synchronization busy bit mask. */
#define LDO_SBSY_bp  7  /* Synchronization busy bit position. */

/* MCU - MCU Control */
/* MCU.DEVID0  bit masks and bit positions */
#define MCU_DEVID0_gm  0xFF  /* Device ID 0 group mask. */
#define MCU_DEVID0_gp  0  /* Device ID 0 group position. */
#define MCU_DEVID00_bm  (1<<0)  /* Device ID 0 bit 0 mask. */
#define MCU_DEVID00_bp  0  /* Device ID 0 bit 0 position. */
#define MCU_DEVID01_bm  (1<<1)  /* Device ID 0 bit 1 mask. */
#define MCU_DEVID01_bp  1  /* Device ID 0 bit 1 position. */
#define MCU_DEVID02_bm  (1<<2)  /* Device ID 0 bit 2 mask. */
#define MCU_DEVID02_bp  2  /* Device ID 0 bit 2 position. */
#define MCU_DEVID03_bm  (1<<3)  /* Device ID 0 bit 3 mask. */
#define MCU_DEVID03_bp  3  /* Device ID 0 bit 3 position. */
#define MCU_DEVID04_bm  (1<<4)  /* Device ID 0 bit 4 mask. */
#define MCU_DEVID04_bp  4  /* Device ID 0 bit 4 position. */
#define MCU_DEVID05_bm  (1<<5)  /* Device ID 0 bit 5 mask. */
#define MCU_DEVID05_bp  5  /* Device ID 0 bit 5 position. */
#define MCU_DEVID06_bm  (1<<6)  /* Device ID 0 bit 6 mask. */
#define MCU_DEVID06_bp  6  /* Device ID 0 bit 6 position. */
#define MCU_DEVID07_bm  (1<<7)  /* Device ID 0 bit 7 mask. */
#define MCU_DEVID07_bp  7  /* Device ID 0 bit 7 position. */

/* MCU.DEVID1  bit masks and bit positions */
#define MCU_DEVID1_gm  0xFF  /* Device ID 1 group mask. */
#define MCU_DEVID1_gp  0  /* Device ID 1 group position. */
#define MCU_DEVID10_bm  (1<<0)  /* Device ID 1 bit 0 mask. */
#define MCU_DEVID10_bp  0  /* Device ID 1 bit 0 position. */
#define MCU_DEVID11_bm  (1<<1)  /* Device ID 1 bit 1 mask. */
#define MCU_DEVID11_bp  1  /* Device ID 1 bit 1 position. */
#define MCU_DEVID12_bm  (1<<2)  /* Device ID 1 bit 2 mask. */
#define MCU_DEVID12_bp  2  /* Device ID 1 bit 2 position. */
#define MCU_DEVID13_bm  (1<<3)  /* Device ID 1 bit 3 mask. */
#define MCU_DEVID13_bp  3  /* Device ID 1 bit 3 position. */
#define MCU_DEVID14_bm  (1<<4)  /* Device ID 1 bit 4 mask. */
#define MCU_DEVID14_bp  4  /* Device ID 1 bit 4 position. */
#define MCU_DEVID15_bm  (1<<5)  /* Device ID 1 bit 5 mask. */
#define MCU_DEVID15_bp  5  /* Device ID 1 bit 5 position. */
#define MCU_DEVID16_bm  (1<<6)  /* Device ID 1 bit 6 mask. */
#define MCU_DEVID16_bp  6  /* Device ID 1 bit 6 position. */
#define MCU_DEVID17_bm  (1<<7)  /* Device ID 1 bit 7 mask. */
#define MCU_DEVID17_bp  7  /* Device ID 1 bit 7 position. */

/* MCU.DEVID2  bit masks and bit positions */
#define MCU_DEVID2_gm  0xFF  /* Device ID 2 group mask. */
#define MCU_DEVID2_gp  0  /* Device ID 2 group position. */
#define MCU_DEVID20_bm  (1<<0)  /* Device ID 2 bit 0 mask. */
#define MCU_DEVID20_bp  0  /* Device ID 2 bit 0 position. */
#define MCU_DEVID21_bm  (1<<1)  /* Device ID 2 bit 1 mask. */
#define MCU_DEVID21_bp  1  /* Device ID 2 bit 1 position. */
#define MCU_DEVID22_bm  (1<<2)  /* Device ID 2 bit 2 mask. */
#define MCU_DEVID22_bp  2  /* Device ID 2 bit 2 position. */
#define MCU_DEVID23_bm  (1<<3)  /* Device ID 2 bit 3 mask. */
#define MCU_DEVID23_bp  3  /* Device ID 2 bit 3 position. */
#define MCU_DEVID24_bm  (1<<4)  /* Device ID 2 bit 4 mask. */
#define MCU_DEVID24_bp  4  /* Device ID 2 bit 4 position. */
#define MCU_DEVID25_bm  (1<<5)  /* Device ID 2 bit 5 mask. */
#define MCU_DEVID25_bp  5  /* Device ID 2 bit 5 position. */
#define MCU_DEVID26_bm  (1<<6)  /* Device ID 2 bit 6 mask. */
#define MCU_DEVID26_bp  6  /* Device ID 2 bit 6 position. */
#define MCU_DEVID27_bm  (1<<7)  /* Device ID 2 bit 7 mask. */
#define MCU_DEVID27_bp  7  /* Device ID 2 bit 7 position. */

/* MCU.REVID  bit masks and bit positions */
#define MCU_REVID_gm  0xFF  /* Revision ID group mask. */
#define MCU_REVID_gp  0  /* Revision ID group position. */
#define MCU_REVID0_bm  (1<<0)  /* Revision ID bit 0 mask. */
#define MCU_REVID0_bp  0  /* Revision ID bit 0 position. */
#define MCU_REVID1_bm  (1<<1)  /* Revision ID bit 1 mask. */
#define MCU_REVID1_bp  1  /* Revision ID bit 1 position. */
#define MCU_REVID2_bm  (1<<2)  /* Revision ID bit 2 mask. */
#define MCU_REVID2_bp  2  /* Revision ID bit 2 position. */
#define MCU_REVID3_bm  (1<<3)  /* Revision ID bit 3 mask. */
#define MCU_REVID3_bp  3  /* Revision ID bit 3 position. */
#define MCU_REVID4_bm  (1<<4)  /* Revision ID bit 4 mask. */
#define MCU_REVID4_bp  4  /* Revision ID bit 4 position. */
#define MCU_REVID5_bm  (1<<5)  /* Revision ID bit 5 mask. */
#define MCU_REVID5_bp  5  /* Revision ID bit 5 position. */
#define MCU_REVID6_bm  (1<<6)  /* Revision ID bit 6 mask. */
#define MCU_REVID6_bp  6  /* Revision ID bit 6 position. */
#define MCU_REVID7_bm  (1<<7)  /* Revision ID bit 7 mask. */
#define MCU_REVID7_bp  7  /* Revision ID bit 7 position. */

/* NVM - Non Volatile Memory Controller */
/* NVM.ADDR0  bit masks and bit positions */
#define NVM_ADDR_gm  0xFF  /* Address Register Byte 0 group mask. */
#define NVM_ADDR_gp  0  /* Address Register Byte 0 group position. */
#define NVM_ADDR0_bm  (1<<0)  /* Address Register Byte 0 bit 0 mask. */
#define NVM_ADDR0_bp  0  /* Address Register Byte 0 bit 0 position. */
#define NVM_ADDR1_bm  (1<<1)  /* Address Register Byte 0 bit 1 mask. */
#define NVM_ADDR1_bp  1  /* Address Register Byte 0 bit 1 position. */
#define NVM_ADDR2_bm  (1<<2)  /* Address Register Byte 0 bit 2 mask. */
#define NVM_ADDR2_bp  2  /* Address Register Byte 0 bit 2 position. */
#define NVM_ADDR3_bm  (1<<3)  /* Address Register Byte 0 bit 3 mask. */
#define NVM_ADDR3_bp  3  /* Address Register Byte 0 bit 3 position. */
#define NVM_ADDR4_bm  (1<<4)  /* Address Register Byte 0 bit 4 mask. */
#define NVM_ADDR4_bp  4  /* Address Register Byte 0 bit 4 position. */
#define NVM_ADDR5_bm  (1<<5)  /* Address Register Byte 0 bit 5 mask. */
#define NVM_ADDR5_bp  5  /* Address Register Byte 0 bit 5 position. */
#define NVM_ADDR6_bm  (1<<6)  /* Address Register Byte 0 bit 6 mask. */
#define NVM_ADDR6_bp  6  /* Address Register Byte 0 bit 6 position. */
#define NVM_ADDR7_bm  (1<<7)  /* Address Register Byte 0 bit 7 mask. */
#define NVM_ADDR7_bp  7  /* Address Register Byte 0 bit 7 position. */

/* NVM.ADDR1  bit masks and bit positions */
/* NVM_ADDR  is already defined. */

