gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* NVM_PROD_SIGNATURES.TESTTEMPHOTDIFF  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF_gm  0x7F  /* Test Temperature Hot Diff group mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF_gp  0  /* Test Temperature Hot Diff group position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF0_bm  (1<<0)  /* Test Temperature Hot Diff bit 0 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF0_bp  0  /* Test Temperature Hot Diff bit 0 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF1_bm  (1<<1)  /* Test Temperature Hot Diff bit 1 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF1_bp  1  /* Test Temperature Hot Diff bit 1 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF2_bm  (1<<2)  /* Test Temperature Hot Diff bit 2 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF2_bp  2  /* Test Temperature Hot Diff bit 2 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF3_bm  (1<<3)  /* Test Temperature Hot Diff bit 3 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF3_bp  3  /* Test Temperature Hot Diff bit 3 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF4_bm  (1<<4)  /* Test Temperature Hot Diff bit 4 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF4_bp  4  /* Test Temperature Hot Diff bit 4 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF5_bm  (1<<5)  /* Test Temperature Hot Diff bit 5 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF5_bp  5  /* Test Temperature Hot Diff bit 5 position. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF6_bm  (1<<6)  /* Test Temperature Hot Diff bit 6 mask. */
#define NVM_PROD_SIGNATURES_TESTTEMPHOTDIFF6_bp  6  /* Test Temperature Hot Diff bit 6 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gm  0xFF  /* 24MHz RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL_gp  0  /* 24MHz RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL0_bp  0  /* 24MHz RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL1_bp  1  /* 24MHz RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL2_bp  2  /* 24MHz RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL3_bp  3  /* 24MHz RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL4_bp  4  /* 24MHz RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bm  (1<<5)  /* 24MHz RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL5_bp  5  /* 24MHz RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bm  (1<<6)  /* 24MHz RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL6_bp  6  /* 24MHz RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bm  (1<<7)  /* 24MHz RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZL7_bp  7  /* 24MHz RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RCCAL24MHZH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gm  0x1F  /* 24MHz RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH_gp  0  /* 24MHz RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bm  (1<<0)  /* 24MHz RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH0_bp  0  /* 24MHz RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bm  (1<<1)  /* 24MHz RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH1_bp  1  /* 24MHz RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bm  (1<<2)  /* 24MHz RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH2_bp  2  /* 24MHz RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bm  (1<<3)  /* 24MHz RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH3_bp  3  /* 24MHz RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bm  (1<<4)  /* 24MHz RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RCCAL24MHZH4_bp  4  /* 24MHz RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gm  0xFF  /* ULP RC Oscillator Calibration Low Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL_gp  0  /* ULP RC Oscillator Calibration Low Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bm  (1<<0)  /* ULP RC Oscillator Calibration Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL0_bp  0  /* ULP RC Oscillator Calibration Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bm  (1<<1)  /* ULP RC Oscillator Calibration Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL1_bp  1  /* ULP RC Oscillator Calibration Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bm  (1<<2)  /* ULP RC Oscillator Calibration Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL2_bp  2  /* ULP RC Oscillator Calibration Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bm  (1<<3)  /* ULP RC Oscillator Calibration Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL3_bp  3  /* ULP RC Oscillator Calibration Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bm  (1<<4)  /* ULP RC Oscillator Calibration Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL4_bp  4  /* ULP RC Oscillator Calibration Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bm  (1<<5)  /* ULP RC Oscillator Calibration Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL5_bp  5  /* ULP RC Oscillator Calibration Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bm  (1<<6)  /* ULP RC Oscillator Calibration Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL6_bp  6  /* ULP RC Oscillator Calibration Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bm  (1<<7)  /* ULP RC Oscillator Calibration Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALL7_bp  7  /* ULP RC Oscillator Calibration Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCCALH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gm  0x1F  /* ULP RC Oscillator Calibration High Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH_gp  0  /* ULP RC Oscillator Calibration High Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bm  (1<<0)  /* ULP RC Oscillator Calibration High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH0_bp  0  /* ULP RC Oscillator Calibration High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bm  (1<<1)  /* ULP RC Oscillator Calibration High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH1_bp  1  /* ULP RC Oscillator Calibration High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bm  (1<<2)  /* ULP RC Oscillator Calibration High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH2_bp  2  /* ULP RC Oscillator Calibration High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bm  (1<<3)  /* ULP RC Oscillator Calibration High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH3_bp  3  /* ULP RC Oscillator Calibration High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bm  (1<<4)  /* ULP RC Oscillator Calibration High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCCALH4_bp  4  /* ULP RC Oscillator Calibration High Byte bit 4 position. */

/* NVM_PROD_SIGNATURES.RC24MHZROOML  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZROOML_gm  0xFF  /* 24 MHz Room Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML_gp  0  /* 24 MHz Room Low Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML0_bm  (1<<0)  /* 24 MHz Room Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML0_bp  0  /* 24 MHz Room Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML1_bm  (1<<1)  /* 24 MHz Room Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML1_bp  1  /* 24 MHz Room Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML2_bm  (1<<2)  /* 24 MHz Room Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML2_bp  2  /* 24 MHz Room Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML3_bm  (1<<3)  /* 24 MHz Room Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML3_bp  3  /* 24 MHz Room Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML4_bm  (1<<4)  /* 24 MHz Room Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML4_bp  4  /* 24 MHz Room Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML5_bm  (1<<5)  /* 24 MHz Room Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML5_bp  5  /* 24 MHz Room Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML6_bm  (1<<6)  /* 24 MHz Room Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML6_bp  6  /* 24 MHz Room Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML7_bm  (1<<7)  /* 24 MHz Room Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOML7_bp  7  /* 24 MHz Room Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RC24MHZROOMH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH_gm  0xFF  /* 24 MHz Room High Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH_gp  0  /* 24 MHz Room High Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH0_bm  (1<<0)  /* 24 MHz Room High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH0_bp  0  /* 24 MHz Room High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH1_bm  (1<<1)  /* 24 MHz Room High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH1_bp  1  /* 24 MHz Room High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH2_bm  (1<<2)  /* 24 MHz Room High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH2_bp  2  /* 24 MHz Room High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH3_bm  (1<<3)  /* 24 MHz Room High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH3_bp  3  /* 24 MHz Room High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH4_bm  (1<<4)  /* 24 MHz Room High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH4_bp  4  /* 24 MHz Room High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH5_bm  (1<<5)  /* 24 MHz Room High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH5_bp  5  /* 24 MHz Room High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH6_bm  (1<<6)  /* 24 MHz Room High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH6_bp  6  /* 24 MHz Room High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH7_bm  (1<<7)  /* 24 MHz Room High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZROOMH7_bp  7  /* 24 MHz Room High Byte bit 7 position. */

