gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* NVM_PROD_SIGNATURES.RC24MHZHOTL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL_gm  0xFF  /* 24 MHz Hot Low Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL_gp  0  /* 24 MHz Hot Low Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL0_bm  (1<<0)  /* 24 MHz Hot Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL0_bp  0  /* 24 MHz Hot Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL1_bm  (1<<1)  /* 24 MHz Hot Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL1_bp  1  /* 24 MHz Hot Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL2_bm  (1<<2)  /* 24 MHz Hot Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL2_bp  2  /* 24 MHz Hot Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL3_bm  (1<<3)  /* 24 MHz Hot Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL3_bp  3  /* 24 MHz Hot Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL4_bm  (1<<4)  /* 24 MHz Hot Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL4_bp  4  /* 24 MHz Hot Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL5_bm  (1<<5)  /* 24 MHz Hot Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL5_bp  5  /* 24 MHz Hot Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL6_bm  (1<<6)  /* 24 MHz Hot Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL6_bp  6  /* 24 MHz Hot Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL7_bm  (1<<7)  /* 24 MHz Hot Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTL7_bp  7  /* 24 MHz Hot Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.RC24MHZHOTH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH_gm  0xFF  /* 24 MHz Hot High Byte group mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH_gp  0  /* 24 MHz Hot High Byte group position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH0_bm  (1<<0)  /* 24 MHz Hot High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH0_bp  0  /* 24 MHz Hot High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH1_bm  (1<<1)  /* 24 MHz Hot High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH1_bp  1  /* 24 MHz Hot High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH2_bm  (1<<2)  /* 24 MHz Hot High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH2_bp  2  /* 24 MHz Hot High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH3_bm  (1<<3)  /* 24 MHz Hot High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH3_bp  3  /* 24 MHz Hot High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH4_bm  (1<<4)  /* 24 MHz Hot High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH4_bp  4  /* 24 MHz Hot High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH5_bm  (1<<5)  /* 24 MHz Hot High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH5_bp  5  /* 24 MHz Hot High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH6_bm  (1<<6)  /* 24 MHz Hot High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH6_bp  6  /* 24 MHz Hot High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH7_bm  (1<<7)  /* 24 MHz Hot High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_RC24MHZHOTH7_bp  7  /* 24 MHz Hot High Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCROOML  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCROOML_gm  0xFF  /* ULP RC Room Low Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML_gp  0  /* ULP RC Room Low Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML0_bm  (1<<0)  /* ULP RC Room Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML0_bp  0  /* ULP RC Room Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML1_bm  (1<<1)  /* ULP RC Room Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML1_bp  1  /* ULP RC Room Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML2_bm  (1<<2)  /* ULP RC Room Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML2_bp  2  /* ULP RC Room Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML3_bm  (1<<3)  /* ULP RC Room Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML3_bp  3  /* ULP RC Room Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML4_bm  (1<<4)  /* ULP RC Room Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML4_bp  4  /* ULP RC Room Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML5_bm  (1<<5)  /* ULP RC Room Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML5_bp  5  /* ULP RC Room Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML6_bm  (1<<6)  /* ULP RC Room Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML6_bp  6  /* ULP RC Room Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOML7_bm  (1<<7)  /* ULP RC Room Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOML7_bp  7  /* ULP RC Room Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCROOMH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCROOMH_gm  0xFF  /* ULP RC Room High Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH_gp  0  /* ULP RC Room High Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH0_bm  (1<<0)  /* ULP RC Room High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH0_bp  0  /* ULP RC Room High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH1_bm  (1<<1)  /* ULP RC Room High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH1_bp  1  /* ULP RC Room High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH2_bm  (1<<2)  /* ULP RC Room High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH2_bp  2  /* ULP RC Room High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH3_bm  (1<<3)  /* ULP RC Room High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH3_bp  3  /* ULP RC Room High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH4_bm  (1<<4)  /* ULP RC Room High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH4_bp  4  /* ULP RC Room High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH5_bm  (1<<5)  /* ULP RC Room High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH5_bp  5  /* ULP RC Room High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH6_bm  (1<<6)  /* ULP RC Room High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH6_bp  6  /* ULP RC Room High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH7_bm  (1<<7)  /* ULP RC Room High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCROOMH7_bp  7  /* ULP RC Room High Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCHOTL  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCHOTL_gm  0xFF  /* ULP RC Hot Low Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL_gp  0  /* ULP RC Hot Low Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL0_bm  (1<<0)  /* ULP RC Hot Low Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL0_bp  0  /* ULP RC Hot Low Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL1_bm  (1<<1)  /* ULP RC Hot Low Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL1_bp  1  /* ULP RC Hot Low Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL2_bm  (1<<2)  /* ULP RC Hot Low Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL2_bp  2  /* ULP RC Hot Low Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL3_bm  (1<<3)  /* ULP RC Hot Low Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL3_bp  3  /* ULP RC Hot Low Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL4_bm  (1<<4)  /* ULP RC Hot Low Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL4_bp  4  /* ULP RC Hot Low Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL5_bm  (1<<5)  /* ULP RC Hot Low Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL5_bp  5  /* ULP RC Hot Low Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL6_bm  (1<<6)  /* ULP RC Hot Low Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL6_bp  6  /* ULP RC Hot Low Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL7_bm  (1<<7)  /* ULP RC Hot Low Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTL7_bp  7  /* ULP RC Hot Low Byte bit 7 position. */

/* NVM_PROD_SIGNATURES.ULPRCHOTH  bit masks and bit positions */
#define NVM_PROD_SIGNATURES_ULPRCHOTH_gm  0xFF  /* ULP RC Hot High Byte group mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH_gp  0  /* ULP RC Hot High Byte group position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH0_bm  (1<<0)  /* ULP RC Hot High Byte bit 0 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH0_bp  0  /* ULP RC Hot High Byte bit 0 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH1_bm  (1<<1)  /* ULP RC Hot High Byte bit 1 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH1_bp  1  /* ULP RC Hot High Byte bit 1 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH2_bm  (1<<2)  /* ULP RC Hot High Byte bit 2 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH2_bp  2  /* ULP RC Hot High Byte bit 2 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH3_bm  (1<<3)  /* ULP RC Hot High Byte bit 3 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH3_bp  3  /* ULP RC Hot High Byte bit 3 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH4_bm  (1<<4)  /* ULP RC Hot High Byte bit 4 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH4_bp  4  /* ULP RC Hot High Byte bit 4 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH5_bm  (1<<5)  /* ULP RC Hot High Byte bit 5 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH5_bp  5  /* ULP RC Hot High Byte bit 5 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH6_bm  (1<<6)  /* ULP RC Hot High Byte bit 6 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH6_bp  6  /* ULP RC Hot High Byte bit 6 position. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH7_bm  (1<<7)  /* ULP RC Hot High Byte bit 7 mask. */
#define NVM_PROD_SIGNATURES_ULPRCHOTH7_bp  7  /* ULP RC Hot High Byte bit 7 position. */

