gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* SLEEP - Sleep Controller */
/* SLEEP.CTRL  bit masks and bit positions */
#define SLEEP_SEN_bm  0x01  /* Sleep Enable bit mask. */
#define SLEEP_SEN_bp  0  /* Sleep Enable bit position. */
#define SLEEP_SMODE_gm  0x06  /* Sleep Mode Selection group mask. */
#define SLEEP_SMODE_gp  1  /* Sleep Mode Selection group position. */
#define SLEEP_SMODE0_bm  (1<<1)  /* Sleep Mode Selection bit 0 mask. */
#define SLEEP_SMODE0_bp  1  /* Sleep Mode Selection bit 0 position. */
#define SLEEP_SMODE1_bm  (1<<2)  /* Sleep Mode Selection bit 1 mask. */
#define SLEEP_SMODE1_bp  2  /* Sleep Mode Selection bit 1 position. */

/* TIM8_16 - Timer 8/16 bit */
/* TIM8_16.CTRLA  bit masks and bit positions */
#define TIM8_16_CTC_bm  0x01  /* Clear Timer on Compare Match Mode bit mask. */
#define TIM8_16_CTC_bp  0  /* Clear Timer on Compare Match Mode bit position. */
#define TIM8_16_ICES_bm  0x10  /* Input Capture Edge Select bit mask. */
#define TIM8_16_ICES_bp  4  /* Input Capture Edge Select bit position. */
#define TIM8_16_ICNC_bm  0x20  /* Input Capture Noise Canceller bit mask. */
#define TIM8_16_ICNC_bp  5  /* Input Capture Noise Canceller bit position. */
#define TIM8_16_ICEN_bm  0x40  /* Input Capture Mode Enable bit mask. */
#define TIM8_16_ICEN_bp  6  /* Input Capture Mode Enable bit position. */
#define TIM8_16_WORDM_bm  0x80  /* Word (16-bit) Mode bit mask. */
#define TIM8_16_WORDM_bp  7  /* Word (16-bit) Mode bit position. */

/* TIM8_16.CTRLB  bit masks and bit positions */
#define TIM8_16_CS_gm  0x0F  /* Clock Select group mask. */
#define TIM8_16_CS_gp  0  /* Clock Select group position. */
#define TIM8_16_CS0_bm  (1<<0)  /* Clock Select bit 0 mask. */
#define TIM8_16_CS0_bp  0  /* Clock Select bit 0 position. */
#define TIM8_16_CS1_bm  (1<<1)  /* Clock Select bit 1 mask. */
#define TIM8_16_CS1_bp  1  /* Clock Select bit 1 position. */
#define TIM8_16_CS2_bm  (1<<2)  /* Clock Select bit 2 mask. */
#define TIM8_16_CS2_bp  2  /* Clock Select bit 2 position. */
#define TIM8_16_CS3_bm  (1<<3)  /* Clock Select bit 3 mask. */
#define TIM8_16_CS3_bp  3  /* Clock Select bit 3 position. */
#define TIM8_16_ICS_gm  0x70  /* Input Capture Select group mask. */
#define TIM8_16_ICS_gp  4  /* Input Capture Select group position. */
#define TIM8_16_ICS0_bm  (1<<4)  /* Input Capture Select bit 0 mask. */
#define TIM8_16_ICS0_bp  4  /* Input Capture Select bit 0 position. */
#define TIM8_16_ICS1_bm  (1<<5)  /* Input Capture Select bit 1 mask. */
#define TIM8_16_ICS1_bp  5  /* Input Capture Select bit 1 position. */
#define TIM8_16_ICS2_bm  (1<<6)  /* Input Capture Select bit 2 mask. */
#define TIM8_16_ICS2_bp  6  /* Input Capture Select bit 2 position. */

/* TIM8_16.INTMSK  bit masks and bit positions */
#define TIM8_16_OVFILVL_gm  0x03  /* Overflow Interrupt Level group mask. */
#define TIM8_16_OVFILVL_gp  0  /* Overflow Interrupt Level group position. */
#define TIM8_16_OVFILVL0_bm  (1<<0)  /* Overflow Interrupt Level bit 0 mask. */
#define TIM8_16_OVFILVL0_bp  0  /* Overflow Interrupt Level bit 0 position. */
#define TIM8_16_OVFILVL1_bm  (1<<1)  /* Overflow Interrupt Level bit 1 mask. */
#define TIM8_16_OVFILVL1_bp  1  /* Overflow Interrupt Level bit 1 position. */
#define TIM8_16_OCAILVL_gm  0x0C  /* Output Compare Match A Interrupt Level group mask. */
#define TIM8_16_OCAILVL_gp  2  /* Output Compare Match A Interrupt Level group position. */
#define TIM8_16_OCAILVL0_bm  (1<<2)  /* Output Compare Match A Interrupt Level bit 0 mask. */
#define TIM8_16_OCAILVL0_bp  2  /* Output Compare Match A Interrupt Level bit 0 position. */
#define TIM8_16_OCAILVL1_bm  (1<<3)  /* Output Compare Match A Interrupt Level bit 1 mask. */
#define TIM8_16_OCAILVL1_bp  3  /* Output Compare Match A Interrupt Level bit 1 position. */
#define TIM8_16_OCBILVL_gm  0x30  /* Output Compare Match B Interrupt Level group mask. */
#define TIM8_16_OCBILVL_gp  4  /* Output Compare Match B Interrupt Level group position. */
#define TIM8_16_OCBILVL0_bm  (1<<4)  /* Output Compare Match B Interrupt Level bit 0 mask. */
#define TIM8_16_OCBILVL0_bp  4  /* Output Compare Match B Interrupt Level bit 0 position. */
#define TIM8_16_OCBILVL1_bm  (1<<5)  /* Output Compare Match B Interrupt Level bit 1 mask. */
#define TIM8_16_OCBILVL1_bp  5  /* Output Compare Match B Interrupt Level bit 1 position. */
#define TIM8_16_ICILVL_gm  0xC0  /* Input Capture Interrupt Level group mask. */
#define TIM8_16_ICILVL_gp  6  /* Input Capture Interrupt Level group position. */
#define TIM8_16_ICILVL0_bm  (1<<6)  /* Input Capture Interrupt Level bit 0 mask. */
#define TIM8_16_ICILVL0_bp  6  /* Input Capture Interrupt Level bit 0 position. */
#define TIM8_16_ICILVL1_bm  (1<<7)  /* Input Capture Interrupt Level bit 1 mask. */
#define TIM8_16_ICILVL1_bp  7  /* Input Capture Interrupt Level bit 1 position. */

/* TIM8_16.STATUS  bit masks and bit positions */
#define TIM8_16_OVF_bm  0x01  /* Overflow Interrupt Flag bit mask. */
#define TIM8_16_OVF_bp  0  /* Overflow Interrupt Flag bit position. */
#define TIM8_16_OCFA_bm  0x02  /* Output Compare Match A Interrupt Flag bit mask. */
#define TIM8_16_OCFA_bp  1  /* Output Compare Match A Interrupt Flag bit position. */
#define TIM8_16_OCFB_bm  0x04  /* Output Compare Match B Interrupt Flag bit mask. */
#define TIM8_16_OCFB_bp  2  /* Output Compare Match B Interrupt Flag bit position. */
#define TIM8_16_ICF_bm  0x08  /* Input Capture Interrupt Flag bit mask. */
#define TIM8_16_ICF_bp  3  /* Input Capture Interrupt Flag bit position. */

/* TIM8_16.TEMP  bit masks and bit positions */
#define TIM8_16_TEMP_gm  0xFF  /* Temporary High Byte Value group mask. */
#define TIM8_16_TEMP_gp  0  /* Temporary High Byte Value group position. */
#define TIM8_16_TEMP0_bm  (1<<0)  /* Temporary High Byte Value bit 0 mask. */
#define TIM8_16_TEMP0_bp  0  /* Temporary High Byte Value bit 0 position. */
#define TIM8_16_TEMP1_bm  (1<<1)  /* Temporary High Byte Value bit 1 mask. */
#define TIM8_16_TEMP1_bp  1  /* Temporary High Byte Value bit 1 position. */
#define TIM8_16_TEMP2_bm  (1<<2)  /* Temporary High Byte Value bit 2 mask. */
#define TIM8_16_TEMP2_bp  2  /* Temporary High Byte Value bit 2 position. */
#define TIM8_16_TEMP3_bm  (1<<3)  /* Temporary High Byte Value bit 3 mask. */
#define TIM8_16_TEMP3_bp  3  /* Temporary High Byte Value bit 3 position. */
#define TIM8_16_TEMP4_bm  (1<<4)  /* Temporary High Byte Value bit 4 mask. */
#define TIM8_16_TEMP4_bp  4  /* Temporary High Byte Value bit 4 position. */
#define TIM8_16_TEMP5_bm  (1<<5)  /* Temporary High Byte Value bit 5 mask. */
#define TIM8_16_TEMP5_bp  5  /* Temporary High Byte Value bit 5 position. */
#define TIM8_16_TEMP6_bm  (1<<6)  /* Temporary High Byte Value bit 6 mask. */
#define TIM8_16_TEMP6_bp  6  /* Temporary High Byte Value bit 6 position. */
#define TIM8_16_TEMP7_bm  (1<<7)  /* Temporary High Byte Value bit 7 mask. */
#define TIM8_16_TEMP7_bp  7  /* Temporary High Byte Value bit 7 position. */

/* TIM8_16.COUNTL  bit masks and bit positions */
#define TIM8_16_COUNT_gm  0xFF  /* Counter Value Low Byte group mask. */
#define TIM8_16_COUNT_gp  0  /* Counter Value Low Byte group position. */
#define TIM8_16_COUNT0_bm  (1<<0)  /* Counter Value Low Byte bit 0 mask. */
#define TIM8_16_COUNT0_bp  0  /* Counter Value Low Byte bit 0 position. */
#define TIM8_16_COUNT1_bm  (1<<1)  /* Counter Value Low Byte bit 1 mask. */
#define TIM8_16_COUNT1_bp  1  /* Counter Value Low Byte bit 1 position. */
#define TIM8_16_COUNT2_bm  (1<<2)  /* Counter Value Low Byte bit 2 mask. */
#define TIM8_16_COUNT2_bp  2  /* Counter Value Low Byte bit 2 position. */
#define TIM8_16_COUNT3_bm  (1<<3)  /* Counter Value Low Byte bit 3 mask. */
#define TIM8_16_COUNT3_bp  3  /* Counter Value Low Byte bit 3 position. */
#define TIM8_16_COUNT4_bm  (1<<4)  /* Counter Value Low Byte bit 4 mask. */
#define TIM8_16_COUNT4_bp  4  /* Counter Value Low Byte bit 4 position. */
#define TIM8_16_COUNT5_bm  (1<<5)  /* Counter Value Low Byte bit 5 mask. */
#define TIM8_16_COUNT5_bp  5  /* Counter Value Low Byte bit 5 position. */
#define TIM8_16_COUNT6_bm  (1<<6)  /* Counter Value Low Byte bit 6 mask. */
#define TIM8_16_COUNT6_bp  6  /* Counter Value Low Byte bit 6 position. */
#define TIM8_16_COUNT7_bm  (1<<7)  /* Counter Value Low Byte bit 7 mask. */
#define TIM8_16_COUNT7_bp  7  /* Counter Value Low Byte bit 7 position. */

/* TIM8_16.COUNTH  bit masks and bit positions */
/* TIM8_16_COUNT  is already defined. */

