gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iomxts220.h
/* TIM8_16.OCRA  bit masks and bit positions */
#define TIM8_16_OCRA_gm  0xFF  /* Output Compare Value A group mask. */
#define TIM8_16_OCRA_gp  0  /* Output Compare Value A group position. */
#define TIM8_16_OCRA0_bm  (1<<0)  /* Output Compare Value A bit 0 mask. */
#define TIM8_16_OCRA0_bp  0  /* Output Compare Value A bit 0 position. */
#define TIM8_16_OCRA1_bm  (1<<1)  /* Output Compare Value A bit 1 mask. */
#define TIM8_16_OCRA1_bp  1  /* Output Compare Value A bit 1 position. */
#define TIM8_16_OCRA2_bm  (1<<2)  /* Output Compare Value A bit 2 mask. */
#define TIM8_16_OCRA2_bp  2  /* Output Compare Value A bit 2 position. */
#define TIM8_16_OCRA3_bm  (1<<3)  /* Output Compare Value A bit 3 mask. */
#define TIM8_16_OCRA3_bp  3  /* Output Compare Value A bit 3 position. */
#define TIM8_16_OCRA4_bm  (1<<4)  /* Output Compare Value A bit 4 mask. */
#define TIM8_16_OCRA4_bp  4  /* Output Compare Value A bit 4 position. */
#define TIM8_16_OCRA5_bm  (1<<5)  /* Output Compare Value A bit 5 mask. */
#define TIM8_16_OCRA5_bp  5  /* Output Compare Value A bit 5 position. */
#define TIM8_16_OCRA6_bm  (1<<6)  /* Output Compare Value A bit 6 mask. */
#define TIM8_16_OCRA6_bp  6  /* Output Compare Value A bit 6 position. */
#define TIM8_16_OCRA7_bm  (1<<7)  /* Output Compare Value A bit 7 mask. */
#define TIM8_16_OCRA7_bp  7  /* Output Compare Value A bit 7 position. */

/* TIM8_16.OCRB  bit masks and bit positions */
#define TIM8_16_OCRB_gm  0xFF  /* Output Compare Value B group mask. */
#define TIM8_16_OCRB_gp  0  /* Output Compare Value B group position. */
#define TIM8_16_OCRB0_bm  (1<<0)  /* Output Compare Value B bit 0 mask. */
#define TIM8_16_OCRB0_bp  0  /* Output Compare Value B bit 0 position. */
#define TIM8_16_OCRB1_bm  (1<<1)  /* Output Compare Value B bit 1 mask. */
#define TIM8_16_OCRB1_bp  1  /* Output Compare Value B bit 1 position. */
#define TIM8_16_OCRB2_bm  (1<<2)  /* Output Compare Value B bit 2 mask. */
#define TIM8_16_OCRB2_bp  2  /* Output Compare Value B bit 2 position. */
#define TIM8_16_OCRB3_bm  (1<<3)  /* Output Compare Value B bit 3 mask. */
#define TIM8_16_OCRB3_bp  3  /* Output Compare Value B bit 3 position. */
#define TIM8_16_OCRB4_bm  (1<<4)  /* Output Compare Value B bit 4 mask. */
#define TIM8_16_OCRB4_bp  4  /* Output Compare Value B bit 4 position. */
#define TIM8_16_OCRB5_bm  (1<<5)  /* Output Compare Value B bit 5 mask. */
#define TIM8_16_OCRB5_bp  5  /* Output Compare Value B bit 5 position. */
#define TIM8_16_OCRB6_bm  (1<<6)  /* Output Compare Value B bit 6 mask. */
#define TIM8_16_OCRB6_bp  6  /* Output Compare Value B bit 6 position. */
#define TIM8_16_OCRB7_bm  (1<<7)  /* Output Compare Value B bit 7 mask. */
#define TIM8_16_OCRB7_bp  7  /* Output Compare Value B bit 7 position. */

/* TIMPRESC - Timer Prescaler */
/* TIMPRESC.PRESC  bit masks and bit positions */
#define TIMPRESC_PSRSYNC_bm  0x01  /* Prescaler Reset bit mask. */
#define TIMPRESC_PSRSYNC_bp  0  /* Prescaler Reset bit position. */
#define TIMPRESC_TSM_bm  0x80  /* Timer Synchronization mode Register bit mask. */
#define TIMPRESC_TSM_bp  7  /* Timer Synchronization mode Register bit position. */

/* TWI - Two-Wire Interface */
/* TWI.CTRL  bit masks and bit positions */
#define TWI_EDIEN_bm  0x01  /* External Driver Interface Enable bit mask. */
#define TWI_EDIEN_bp  0  /* External Driver Interface Enable bit position. */
#define TWI_SDAHOLD_gm  0x06  /* SDA Hold Time Enable group mask. */
#define TWI_SDAHOLD_gp  1  /* SDA Hold Time Enable group position. */
#define TWI_SDAHOLD0_bm  (1<<1)  /* SDA Hold Time Enable bit 0 mask. */
#define TWI_SDAHOLD0_bp  1  /* SDA Hold Time Enable bit 0 position. */
#define TWI_SDAHOLD1_bm  (1<<2)  /* SDA Hold Time Enable bit 1 mask. */
#define TWI_SDAHOLD1_bp  2  /* SDA Hold Time Enable bit 1 position. */

/* TWI_MASTER.CTRLA  bit masks and bit positions */
#define TWI_MASTER_ENABLE_bm  0x08  /* Enable TWI Master bit mask. */
#define TWI_MASTER_ENABLE_bp  3  /* Enable TWI Master bit position. */
#define TWI_MASTER_WIEN_bm  0x10  /* Write Interrupt Enable bit mask. */
#define TWI_MASTER_WIEN_bp  4  /* Write Interrupt Enable bit position. */
#define TWI_MASTER_RIEN_bm  0x20  /* Read Interrupt Enable bit mask. */
#define TWI_MASTER_RIEN_bp  5  /* Read Interrupt Enable bit position. */
#define TWI_MASTER_INTLVL_gm  0xC0  /* Interrupt Level group mask. */
#define TWI_MASTER_INTLVL_gp  6  /* Interrupt Level group position. */
#define TWI_MASTER_INTLVL0_bm  (1<<6)  /* Interrupt Level bit 0 mask. */
#define TWI_MASTER_INTLVL0_bp  6  /* Interrupt Level bit 0 position. */
#define TWI_MASTER_INTLVL1_bm  (1<<7)  /* Interrupt Level bit 1 mask. */
#define TWI_MASTER_INTLVL1_bp  7  /* Interrupt Level bit 1 position. */

/* TWI_MASTER.CTRLB  bit masks and bit positions */
#define TWI_MASTER_SMEN_bm  0x01  /* Smart Mode Enable bit mask. */
#define TWI_MASTER_SMEN_bp  0  /* Smart Mode Enable bit position. */
#define TWI_MASTER_QCEN_bm  0x02  /* Quick Command Enable bit mask. */
#define TWI_MASTER_QCEN_bp  1  /* Quick Command Enable bit position. */
#define TWI_MASTER_TIMEOUT_gm  0x0C  /* Inactive Bus Timeout group mask. */
#define TWI_MASTER_TIMEOUT_gp  2  /* Inactive Bus Timeout group position. */
#define TWI_MASTER_TIMEOUT0_bm  (1<<2)  /* Inactive Bus Timeout bit 0 mask. */
#define TWI_MASTER_TIMEOUT0_bp  2  /* Inactive Bus Timeout bit 0 position. */
#define TWI_MASTER_TIMEOUT1_bm  (1<<3)  /* Inactive Bus Timeout bit 1 mask. */
#define TWI_MASTER_TIMEOUT1_bp  3  /* Inactive Bus Timeout bit 1 position. */

/* TWI_MASTER.CTRLC  bit masks and bit positions */
#define TWI_MASTER_CMD_gm  0x03  /* Command group mask. */
#define TWI_MASTER_CMD_gp  0  /* Command group position. */
#define TWI_MASTER_CMD0_bm  (1<<0)  /* Command bit 0 mask. */
#define TWI_MASTER_CMD0_bp  0  /* Command bit 0 position. */
#define TWI_MASTER_CMD1_bm  (1<<1)  /* Command bit 1 mask. */
#define TWI_MASTER_CMD1_bp  1  /* Command bit 1 position. */
#define TWI_MASTER_ACKACT_bm  0x04  /* Acknowledge Action bit mask. */
#define TWI_MASTER_ACKACT_bp  2  /* Acknowledge Action bit position. */

/* TWI_MASTER.STATUS  bit masks and bit positions */
#define TWI_MASTER_BUSSTATE_gm  0x03  /* Bus State group mask. */
#define TWI_MASTER_BUSSTATE_gp  0  /* Bus State group position. */
#define TWI_MASTER_BUSSTATE0_bm  (1<<0)  /* Bus State bit 0 mask. */
#define TWI_MASTER_BUSSTATE0_bp  0  /* Bus State bit 0 position. */
#define TWI_MASTER_BUSSTATE1_bm  (1<<1)  /* Bus State bit 1 mask. */
#define TWI_MASTER_BUSSTATE1_bp  1  /* Bus State bit 1 position. */
#define TWI_MASTER_BUSERR_bm  0x04  /* Bus Error bit mask. */
#define TWI_MASTER_BUSERR_bp  2  /* Bus Error bit position. */
#define TWI_MASTER_ARBLOST_bm  0x08  /* Arbitration Lost bit mask. */
#define TWI_MASTER_ARBLOST_bp  3  /* Arbitration Lost bit position. */
#define TWI_MASTER_RXACK_bm  0x10  /* Received Acknowledge bit mask. */
#define TWI_MASTER_RXACK_bp  4  /* Received Acknowledge bit position. */
#define TWI_MASTER_CLKHOLD_bm  0x20  /* Clock Hold bit mask. */
#define TWI_MASTER_CLKHOLD_bp  5  /* Clock Hold bit position. */
#define TWI_MASTER_WIF_bm  0x40  /* Write Interrupt Flag bit mask. */
#define TWI_MASTER_WIF_bp  6  /* Write Interrupt Flag bit position. */
#define TWI_MASTER_RIF_bm  0x80  /* Read Interrupt Flag bit mask. */
#define TWI_MASTER_RIF_bp  7  /* Read Interrupt Flag bit position. */

/* TWI_MASTER.BAUD  bit masks and bit positions */
#define TWI_MASTER_BAUD_gm  0xFF  /* Baud Rade Register group mask. */
#define TWI_MASTER_BAUD_gp  0  /* Baud Rade Register group position. */
#define TWI_MASTER_BAUD0_bm  (1<<0)  /* Baud Rade Register bit 0 mask. */
#define TWI_MASTER_BAUD0_bp  0  /* Baud Rade Register bit 0 position. */
#define TWI_MASTER_BAUD1_bm  (1<<1)  /* Baud Rade Register bit 1 mask. */
#define TWI_MASTER_BAUD1_bp  1  /* Baud Rade Register bit 1 position. */
#define TWI_MASTER_BAUD2_bm  (1<<2)  /* Baud Rade Register bit 2 mask. */
#define TWI_MASTER_BAUD2_bp  2  /* Baud Rade Register bit 2 position. */
#define TWI_MASTER_BAUD3_bm  (1<<3)  /* Baud Rade Register bit 3 mask. */
#define TWI_MASTER_BAUD3_bp  3  /* Baud Rade Register bit 3 position. */
#define TWI_MASTER_BAUD4_bm  (1<<4)  /* Baud Rade Register bit 4 mask. */
#define TWI_MASTER_BAUD4_bp  4  /* Baud Rade Register bit 4 position. */
#define TWI_MASTER_BAUD5_bm  (1<<5)  /* Baud Rade Register bit 5 mask. */
#define TWI_MASTER_BAUD5_bp  5  /* Baud Rade Register bit 5 position. */
#define TWI_MASTER_BAUD6_bm  (1<<6)  /* Baud Rade Register bit 6 mask. */
#define TWI_MASTER_BAUD6_bp  6  /* Baud Rade Register bit 6 position. */
#define TWI_MASTER_BAUD7_bm  (1<<7)  /* Baud Rade Register bit 7 mask. */
#define TWI_MASTER_BAUD7_bp  7  /* Baud Rade Register bit 7 position. */

